{
    "account": "@PaulStanleyLive",
    "type": "Rock",
    "tweets": [
        {
            "date": "2022-02-25 03:46:24+00:00",
            "tweet_raw": "While we are living our everyday blessed lives, the people of Ukraine are fighting for theirs against overwhelming odds.We are watching in real time as families are decimated and a country is battered. There's a dark cloud over us all who are powerless today to help. I will pray. https://t.co/btJJLEGa8E",
            "tweet": "while we are living our everyday blessed lives, the people of ukraine are fighting for theirs against overwhelming odds.we are watching in real time as families are decimated and a country is battered. there's a dark cloud over us all who are powerless today to help. i will pray. "
        },
        {
            "date": "2021-05-12 16:35:06+00:00",
            "tweet_raw": "Happy Birthday Eric!! My friend for decades and lucky for us, our incredible drummer. Enjoy this day! https://t.co/EaAH43c2WM",
            "tweet": "happy birthday eric!! my friend for decades and lucky for us, our incredible drummer. enjoy this day! "
        },
        {
            "date": "2021-03-19 18:57:46+00:00",
            "tweet_raw": "I had a great time talking with Jenn on Apple Music Rock Classics Radio! Listen starting at 1PM PT &amp; on-demand on @AppleMusic.\n\nhttps://t.co/jzhyYnXQFT https://t.co/6wWOMDy7vn",
            "tweet": "i had a great time talking with jenn on apple music rock classics radio! listen starting at 1pm pt &amp; on-demand on .\n\n "
        },
        {
            "date": "2021-03-23 01:38:56+00:00",
            "tweet_raw": ".@Songfacts Interview\nhttps://t.co/s0svmFs9Nx https://t.co/SG9HGWnbBN",
            "tweet": ". interview\n "
        },
        {
            "date": "2021-07-02 18:12:09+00:00",
            "tweet_raw": "Words Hurt. In our documentary I spoke of my dear friend Bob Ezrin as a “functioning addict” while we made Destroyer. The impact of that word was lost on me. Although not intended, the hurt &amp; stigma attached is far reaching. That statement was inaccurate, not true and I misspoke. https://t.co/jW1uqrKoZZ",
            "tweet": "words hurt. in our documentary i spoke of my dear friend bob ezrin as a “functioning addict” while we made destroyer. the impact of that word was lost on me. although not intended, the hurt &amp; stigma attached is far reaching. that statement was inaccurate, not true and i misspoke. "
        },
        {
            "date": "2021-04-01 17:00:19+00:00",
            "tweet_raw": "Tonight! https://t.co/MigmV9S8ax",
            "tweet": "tonight! "
        },
        {
            "date": "2021-09-17 04:04:31+00:00",
            "tweet_raw": "Sunday Night was EXPLOSIVE. Tomorrow night PORTLAND it's YOUR turn and I AM READY! https://t.co/oVykvnp98p",
            "tweet": "sunday night was explosive. tomorrow night portland it's your turn and i am ready! "
        },
        {
            "date": "2021-08-20 21:32:42+00:00",
            "tweet_raw": "Speaking of @DavidLeeRoth… I remember seeing him in the 70’s with Van Halen at MSG and thinking to myself “There’s a new sheriff in town” Just amazing what he had evolved into in a few short years. On stage he’s still Diamond Dave! https://t.co/eHWWknzhp5",
            "tweet": "speaking of … i remember seeing him in the 70’s with van halen at msg and thinking to myself “there’s a new sheriff in town” just amazing what he had evolved into in a few short years. on stage he’s still diamond dave! "
        },
        {
            "date": "2021-05-10 04:51:33+00:00",
            "tweet_raw": "I’m Chocolate!! Master Pastry Chef Stephan Schubert at the Seminole Hard Rock Tampa created this completely edible piece! Gives new meaning to a Chocolate KISS! https://t.co/kI2nOeJ0aQ",
            "tweet": "i’m chocolate!! master pastry chef stephan schubert at the seminole hard rock tampa created this completely edible piece! gives new meaning to a chocolate kiss! "
        },
        {
            "date": "2021-02-14 01:01:22+00:00",
            "tweet_raw": "WARNING! Scott's Budino is insanely good and one of my absolute favorite desserts. You will agree for sure. Be ready to exercise after. https://t.co/IzvrmpMG9c",
            "tweet": "warning! scott's budino is insanely good and one of my absolute favorite desserts. you will agree for sure. be ready to exercise after. "
        },
        {
            "date": "2021-03-07 06:00:53+00:00",
            "tweet_raw": "Henry, Henry, Henry.. I will miss you but I will remember growing up making my weekly trips to your dad’s store &amp; yours. I dreamed of being another photo on your wall &amp; when I finally was, you told me to save my money. I always looked forward to seeing you https://t.co/7EVNKoRMVO",
            "tweet": "henry, henry, henry.. i will miss you but i will remember growing up making my weekly trips to your dad’s store &amp; yours. i dreamed of being another photo on your wall &amp; when i finally was, you told me to save my money. i always looked forward to seeing you "
        },
        {
            "date": "2021-02-12 00:51:56+00:00",
            "tweet_raw": "Frittata? Omelet? LEFTOVERS!! Hot Italian sausage, sautéed mushrooms, tomatoes &amp; onion, fresh basil, crushed red pepper, mozzarella and Parmesan Reggiano. AWESOME! https://t.co/lfQuj8xWxD",
            "tweet": "frittata? omelet? leftovers!! hot italian sausage, sautéed mushrooms, tomatoes &amp; onion, fresh basil, crushed red pepper, mozzarella and parmesan reggiano. awesome! "
        },
        {
            "date": "2021-03-22 20:28:45+00:00",
            "tweet_raw": ".@tulsaworld Sunday Feature! #KISS  #SoulStation \n\nhttps://t.co/Is7E8gI036 https://t.co/L5dggDZLML",
            "tweet": ". sunday feature!    \n\n "
        },
        {
            "date": "2021-02-18 00:55:53+00:00",
            "tweet_raw": "WooHoo! Great song! Great video! https://t.co/59UZrJR1Xx",
            "tweet": "woohoo! great song! great video! "
        },
        {
            "date": "2021-02-12 00:51:56+00:00",
            "tweet_raw": "Frittata? Omelet? LEFTOVERS!! Hot Italian sausage, sautéed mushrooms, tomatoes &amp; onion, fresh basil, crushed red pepper, mozzarella and Parmesan Reggiano. AWESOME! https://t.co/lfQuj8xWxD",
            "tweet": "frittata? omelet? leftovers!! hot italian sausage, sautéed mushrooms, tomatoes &amp; onion, fresh basil, crushed red pepper, mozzarella and parmesan reggiano. awesome! "
        },
        {
            "date": "2021-04-18 00:23:09+00:00",
            "tweet_raw": "The Sun's Coming Out! So awesome to have lunch with my dear friend Bob Ezrin today. https://t.co/ViphDawI0y",
            "tweet": "the sun's coming out! so awesome to have lunch with my dear friend bob ezrin today. "
        },
        {
            "date": "2021-05-09 18:31:10+00:00",
            "tweet_raw": "To my mother who helped me become who I am and to my wife Erin who makes me want to strive to be still more. Thank you. Women are the foundation from which all men can accomplish is rooted. I celebrate you all and Happy Mother’s Day.",
            "tweet": "to my mother who helped me become who i am and to my wife erin who makes me want to strive to be still more. thank you. women are the foundation from which all men can accomplish is rooted. i celebrate you all and happy mother’s day."
        },
        {
            "date": "2021-04-22 17:04:15+00:00",
            "tweet_raw": "Go Richard!!!! Welcome back. https://t.co/jlYq2HO6IT",
            "tweet": "go richard!!!! welcome back. "
        },
        {
            "date": "2021-02-14 20:09:36+00:00",
            "tweet_raw": "WOW!!! https://t.co/wCrfoxT7Cq",
            "tweet": "wow!!! "
        },
        {
            "date": "2021-03-18 17:03:25+00:00",
            "tweet_raw": "To celebrate the new album, Now &amp; Then, I’m giving fans in the US, Canada &amp; Germany the chance to win a virtual meet &amp; greet with me! See details + official rules &amp; enter for your chance:\nhttps://t.co/JQUd1jDtxx https://t.co/FK26Iwxycs",
            "tweet": "to celebrate the new album, now &amp; then, i’m giving fans in the us, canada &amp; germany the chance to win a virtual meet &amp; greet with me! see details + official rules &amp; enter for your chance:\n "
        },
        {
            "date": "2021-10-30 18:09:29+00:00",
            "tweet_raw": "KISS Kruise X. We didi a Killer opening sailaway set. Already announced KISS Kruise XI! All the international fans who couldn't make it will get special priority for tickets. Same time next year going out of Los Angeles! https://t.co/FKMqDefeoI",
            "tweet": "kiss kruise x. we didi a killer opening sailaway set. already announced kiss kruise xi! all the international fans who couldn't make it will get special priority for tickets. same time next year going out of los angeles! "
        },
        {
            "date": "2021-03-09 17:17:39+00:00",
            "tweet_raw": "MARCH 19th!!!! https://t.co/zKyH7Hts4x",
            "tweet": "march 19th!!!! "
        },
        {
            "date": "2021-03-09 04:18:55+00:00",
            "tweet_raw": "Signed 1000 PRE-SOLD Soul Station CDs Today. Thank you all for the early support! FRIDAY is RELEASE DAY and I can't wait! I couldn't be more proud of the whole band and the accolades we're getting are exciting and so gratifying. https://t.co/vGZT0tIJun",
            "tweet": "signed 1000 pre-sold soul station cds today. thank you all for the early support! friday is release day and i can't wait! i couldn't be more proud of the whole band and the accolades we're getting are exciting and so gratifying. "
        },
        {
            "date": "2021-08-14 19:04:15+00:00",
            "tweet_raw": "I spent a few minutes last night catching up with @jonimitchell at a restaurant. I’m always in awe of her artistic journeys &amp; spirit. Even through the devastation of an aneurysm she shines. Joni reminded me that she has a KISS pinball machine. What an incredible  woman. Love her. https://t.co/DGZB2VU3eo",
            "tweet": "i spent a few minutes last night catching up with  at a restaurant. i’m always in awe of her artistic journeys &amp; spirit. even through the devastation of an aneurysm she shines. joni reminded me that she has a kiss pinball machine. what an incredible  woman. love her. "
        },
        {
            "date": "2021-04-01 03:04:17+00:00",
            "tweet_raw": "Just Got My Vinyl!\nWOOHOO!!!! Looks AWESOME! https://t.co/ho8LYPIH5x",
            "tweet": "just got my vinyl!\nwoohoo!!!! looks awesome! "
        },
        {
            "date": "2021-07-09 19:15:50+00:00",
            "tweet_raw": "https://t.co/KgoGEIa9rf So glad to see the brothers back in top form. Chris continues to carry that torch of so many of the early greats\nand Rich lays it all down. LOVE it! @theblackcrowes",
            "tweet": " so glad to see the brothers back in top form. chris continues to carry that torch of so many of the early greats\nand rich lays it all down. love it! "
        },
        {
            "date": "2021-12-12 03:31:10+00:00",
            "tweet_raw": "Today was the memorial service to celebrate and remember my dear friend and wingman, Fran Stueber. So much sadness I saw there can only come from so much love. We all miss him and struggle to accept that he’s really gone. I pray for his wonderful family. Truly tragic. https://t.co/kf3XElU2dC",
            "tweet": "today was the memorial service to celebrate and remember my dear friend and wingman, fran stueber. so much sadness i saw there can only come from so much love. we all miss him and struggle to accept that he’s really gone. i pray for his wonderful family. truly tragic. "
        },
        {
            "date": "2022-04-01 12:41:32+00:00",
            "tweet_raw": "No words... https://t.co/goX3O2weUk",
            "tweet": "no words... "
        },
        {
            "date": "2021-06-23 21:45:55+00:00",
            "tweet_raw": "Vacation?? Yes! But STILL getting ready for The End Of The Road in August!! https://t.co/FNKNpdDkHu",
            "tweet": "vacation?? yes! but still getting ready for the end of the road in august!! "
        },
        {
            "date": "2021-02-14 19:25:34+00:00",
            "tweet_raw": "Back To The Lasagna Soup!... I’m vegetarian. For those of you who aren’t, use less olive oil if using meat sausage since it has fat and you can use a unsalted or low sodium chicken or beef stock. That’s all!! https://t.co/a4SDimKpa7",
            "tweet": "back to the lasagna soup!... i’m vegetarian. for those of you who aren’t, use less olive oil if using meat sausage since it has fat and you can use a unsalted or low sodium chicken or beef stock. that’s all!! "
        },
        {
            "date": "2021-03-19 20:44:28+00:00",
            "tweet_raw": "Talking #SOULSTATION with @YahooEnt\nhttps://t.co/xJDjEbaSkv",
            "tweet": "talking  with \n"
        },
        {
            "date": "2022-03-27 00:59:55+00:00",
            "tweet_raw": "Family Vacation!! A great time ahead for us before the End Of The Road resumes. Awesome and needed by us all. https://t.co/naJYxOXVfe",
            "tweet": "family vacation!! a great time ahead for us before the end of the road resumes. awesome and needed by us all. "
        },
        {
            "date": "2021-03-22 23:20:05+00:00",
            "tweet_raw": ".@USATODAY cover story! Highest circulation paper in America. Great interview and review! #SoulStation https://t.co/8eDfhysQhM",
            "tweet": ". cover story! highest circulation paper in america. great interview and review!  "
        },
        {
            "date": "2021-04-01 05:06:25+00:00",
            "tweet_raw": "Amen. And if you don’t know it, You don’t deserve it. https://t.co/QQzFOIsPBU",
            "tweet": "amen. and if you don’t know it, you don’t deserve it. "
        },
        {
            "date": "2022-02-27 04:59:28+00:00",
            "tweet_raw": "I Keep Wondering… Now that we live in an age where we can view carnage &amp; loss of human life in real time, do we have a higher moral obligation to humanity? We can watch the tragedy of someone else’s plight unfold and yet we’re powerless to help. This new world throws me. https://t.co/ge8SSWuOUD",
            "tweet": "i keep wondering… now that we live in an age where we can view carnage &amp; loss of human life in real time, do we have a higher moral obligation to humanity? we can watch the tragedy of someone else’s plight unfold and yet we’re powerless to help. this new world throws me. "
        },
        {
            "date": "2022-03-08 04:38:57+00:00",
            "tweet_raw": "PLEASE, PLEASE, PLEASE... These are people just like us. These are children just like ours. Their lives have been shattered in an unimaginable siege of destruction and murder. It's happening at this very moment. We are BLESSED. WE can help. Donate now.\n https://t.co/bXPoJZC4bk https://t.co/yryM2yETNd",
            "tweet": "please, please, please... these are people just like us. these are children just like ours. their lives have been shattered in an unimaginable siege of destruction and murder. it's happening at this very moment. we are blessed. we can help. donate now.\n  "
        },
        {
            "date": "2021-06-19 08:01:54+00:00",
            "tweet_raw": "Things work out out as they’re meant to. Many years ago I lost touch with Kelsey Grammer, who I shared a strong connection with. I missed him &amp; couldn’t figure it out. I agreed to co-host @TheTalkCBS &amp; turns out Kelsey is a guest! So glad to reconnect &amp; pick up where we left off.",
            "tweet": "things work out out as they’re meant to. many years ago i lost touch with kelsey grammer, who i shared a strong connection with. i missed him &amp; couldn’t figure it out. i agreed to co-host  &amp; turns out kelsey is a guest! so glad to reconnect &amp; pick up where we left off."
        },
        {
            "date": "2021-05-24 22:38:45+00:00",
            "tweet_raw": "I REALLY like this interview! I hope you enjoy it too. https://t.co/KqMhaqyASX",
            "tweet": "i really like this interview! i hope you enjoy it too. "
        },
        {
            "date": "2021-06-15 03:49:58+00:00",
            "tweet_raw": "And right back atcha!!! https://t.co/dFvtV5LsOa",
            "tweet": "and right back atcha!!! "
        },
        {
            "date": "2021-03-04 17:34:38+00:00",
            "tweet_raw": "Chat with me live on the @TalkShopLive Rock N Roll channel and preorder a copy of my upcoming album, Now And Then—the first 500 orders will receive an autographed CD booklet.\n\nRSVP here:\nhttps://t.co/xjBxaEsT7t https://t.co/fq20fGBtRw",
            "tweet": "chat with me live on the  rock n roll channel and preorder a copy of my upcoming album, now and then—the first 500 orders will receive an autographed cd booklet.\n\nrsvp here:\n "
        },
        {
            "date": "2021-05-12 16:35:06+00:00",
            "tweet_raw": "Happy Birthday Eric!! My friend for decades and lucky for us, our incredible drummer. Enjoy this day! https://t.co/EaAH43c2WM",
            "tweet": "happy birthday eric!! my friend for decades and lucky for us, our incredible drummer. enjoy this day! "
        },
        {
            "date": "2021-10-20 20:03:38+00:00",
            "tweet_raw": "Okay... So I started eating this awesome complex, spicy, rich farfalle dish and immediately wanted to send my compliments to the chef... but it was me. https://t.co/qg6EqR0erx",
            "tweet": "okay... so i started eating this awesome complex, spicy, rich farfalle dish and immediately wanted to send my compliments to the chef... but it was me. "
        },
        {
            "date": "2021-07-25 18:30:22+00:00",
            "tweet_raw": "If we focus on the fact there IS good in this world, we can BE a part of that good. Changing the world starts with each one of us. https://t.co/NmigXicZQd",
            "tweet": "if we focus on the fact there is good in this world, we can be a part of that good. changing the world starts with each one of us. "
        },
        {
            "date": "2021-02-26 04:31:26+00:00",
            "tweet_raw": "I'VE DONE FIFTY ONE SOUL STATION ALBUM INTERVIEWS SO FAR AND NO END IN SIGHT. Doing as many as I can to spread the word. So thankful to everyone for rave reviews. I can't wait for you to hear the entire album MARCH 19th. The VINYL PACKAGE is AWESOME! Going to lay down now. https://t.co/3CHYrBI3iz",
            "tweet": "i've done fifty one soul station album interviews so far and no end in sight. doing as many as i can to spread the word. so thankful to everyone for rave reviews. i can't wait for you to hear the entire album march 19th. the vinyl package is awesome! going to lay down now. "
        },
        {
            "date": "2021-05-23 17:23:01+00:00",
            "tweet_raw": "I LOVE this!! https://t.co/LnIcWRF26j",
            "tweet": "i love this!! "
        },
        {
            "date": "2021-05-23 17:23:01+00:00",
            "tweet_raw": "I LOVE this!! https://t.co/LnIcWRF26j",
            "tweet": "i love this!! "
        },
        {
            "date": "2021-08-20 00:04:46+00:00",
            "tweet_raw": "FIVE MINUTES Bangor until CHAOS! https://t.co/bxqxWNujUO",
            "tweet": "five minutes bangor until chaos! "
        },
        {
            "date": "2021-03-05 13:28:56+00:00",
            "tweet_raw": "As much as #SoulStation is rooted in the past, I wanted our music to also live in the present. “I, Oh I” shows what can grow from those deep roots. With love &amp; respect we’re proud of where we come from &amp; where we’re going. The first of 5 originals! https://t.co/eush8VOjBa https://t.co/eHHKCGd0I1",
            "tweet": "as much as  is rooted in the past, i wanted our music to also live in the present. “i, oh i” shows what can grow from those deep roots. with love &amp; respect we’re proud of where we come from &amp; where we’re going. the first of 5 originals!  "
        },
        {
            "date": "2021-04-01 05:06:25+00:00",
            "tweet_raw": "Amen. And if you don’t know it, You don’t deserve it. https://t.co/QQzFOIsPBU",
            "tweet": "amen. and if you don’t know it, you don’t deserve it. "
        },
        {
            "date": "2022-04-05 08:28:39+00:00",
            "tweet_raw": "WOW! If this is true it’s APPALLING. https://t.co/aSYGIEIjiZ",
            "tweet": "wow! if this is true it’s appalling. "
        },
        {
            "date": "2021-02-26 17:52:46+00:00",
            "tweet_raw": "A Smile For Everyone I Hope! Never too busy to show some love! https://t.co/7JKfyFARaJ",
            "tweet": "a smile for everyone i hope! never too busy to show some love! "
        },
        {
            "date": "2021-10-07 18:15:56+00:00",
            "tweet_raw": "Go Joe! Besides being the Baddest Blues Guitarist On The Planet and The Tone Master, my buddy JB’s Epiphones can put amazing vintage type guitars in almost everyone’s hands at prices you would have to sell your house to own! https://t.co/MybTOGQ3pU",
            "tweet": "go joe! besides being the baddest blues guitarist on the planet and the tone master, my buddy jb’s epiphones can put amazing vintage type guitars in almost everyone’s hands at prices you would have to sell your house to own! "
        },
        {
            "date": "2021-05-30 05:21:54+00:00",
            "tweet_raw": "I just saw this great recent interview with my dear friend and collaborator, Desmond Child. I’ve been blessed to know him and work together for FORTY YEARS! An amazing history together. Too much talent for one person to possess. @DesmondChild https://t.co/zyxGoE7MVF",
            "tweet": "i just saw this great recent interview with my dear friend and collaborator, desmond child. i’ve been blessed to know him and work together for forty years! an amazing history together. too much talent for one person to possess.  "
        },
        {
            "date": "2021-07-01 01:58:23+00:00",
            "tweet_raw": "When someone feigns sympathy by speaking of “your” truth they are actually saying they don’t believe you. SIXTY women came forward with basically identical accounts of being drugged &amp; raped. THAT is THE truth. Legal technicalities &amp; friendship with the rapist can’t change that. https://t.co/sMCRs3nq8e",
            "tweet": "when someone feigns sympathy by speaking of “your” truth they are actually saying they don’t believe you. sixty women came forward with basically identical accounts of being drugged &amp; raped. that is the truth. legal technicalities &amp; friendship with the rapist can’t change that. "
        },
        {
            "date": "2021-04-10 05:50:14+00:00",
            "tweet_raw": "WINE PORN... Hundred Acre. I don’t know how Jayson Woodbridge does it but I’m sure glad he does. https://t.co/Arjk2f4mJP",
            "tweet": "wine porn... hundred acre. i don’t know how jayson woodbridge does it but i’m sure glad he does. "
        },
        {
            "date": "2021-06-23 21:45:55+00:00",
            "tweet_raw": "Vacation?? Yes! But STILL getting ready for The End Of The Road in August!! https://t.co/FNKNpdDkHu",
            "tweet": "vacation?? yes! but still getting ready for the end of the road in august!! "
        },
        {
            "date": "2021-08-03 05:12:05+00:00",
            "tweet_raw": "My children don't need a camera to make me smile! I'm blessed. https://t.co/md8lbhdUIp",
            "tweet": "my children don't need a camera to make me smile! i'm blessed. "
        },
        {
            "date": "2021-06-13 01:19:26+00:00",
            "tweet_raw": "What’s My All Time Favorite Art Piece? Michelangelo’s Pieta.\nMind boggling and astounding. How does someone infuse a soul into a block of marble, transform it into draping cloth, supple flesh and serene grace?? I’m in awe every time I see it. Wow. https://t.co/Kv0V5sMj2S",
            "tweet": "what’s my all time favorite art piece? michelangelo’s pieta.\nmind boggling and astounding. how does someone infuse a soul into a block of marble, transform it into draping cloth, supple flesh and serene grace?? i’m in awe every time i see it. wow. "
        },
        {
            "date": "2021-04-02 01:27:00+00:00",
            "tweet_raw": "Working Out Again! My mind is ready. My body is ready. Let’s check back in a month! Effort=Effect! https://t.co/arLc4lfTxh",
            "tweet": "working out again! my mind is ready. my body is ready. let’s check back in a month! effort=effect! "
        },
        {
            "date": "2021-06-01 18:47:58+00:00",
            "tweet_raw": "Naomi Osaka is bravely bringing to light that many prominent public figures suffer from depression &amp; other psychological issues. Chastising or penalizing her for publicly acknowledging her struggles is cruel &amp; ugly. My empathy, love and support to her. https://t.co/HO9ggbP2G2",
            "tweet": "naomi osaka is bravely bringing to light that many prominent public figures suffer from depression &amp; other psychological issues. chastising or penalizing her for publicly acknowledging her struggles is cruel &amp; ugly. my empathy, love and support to her. "
        },
        {
            "date": "2021-06-02 01:00:35+00:00",
            "tweet_raw": "Los Angeles WAS Disneyland for musicians. Nothing but music billboards on Sunset Blvd. Coming from New York, I was in awe. https://t.co/RrWHJL8wo5 https://t.co/O9UsLZlUhp",
            "tweet": "los angeles was disneyland for musicians. nothing but music billboards on sunset blvd. coming from new york, i was in awe.  "
        },
        {
            "date": "2021-03-12 17:09:38+00:00",
            "tweet_raw": "Thanks for joining the premiere of “I, Oh, I” with me today! We had such a blast making it together. Watch now &amp; get excited for Now &amp; Then coming in just one week!\n\n https://t.co/54l2iooEvG https://t.co/lNVgR23o3V",
            "tweet": "thanks for joining the premiere of “i, oh, i” with me today! we had such a blast making it together. watch now &amp; get excited for now &amp; then coming in just one week!\n\n  "
        },
        {
            "date": "2021-08-14 05:27:02+00:00",
            "tweet_raw": "FIVE DAYS until the End Begins Again. HOW YA DOIN’ PEOPLE?!? https://t.co/WVuXhnh247",
            "tweet": "five days until the end begins again. how ya doin’ people?!? "
        },
        {
            "date": "2021-05-23 18:01:56+00:00",
            "tweet_raw": "My great friends Cynthia &amp; Paul Rodgers are fostering this perfect dog. Super well mannered, small 35 pounds, 4 years old loves people, children &amp; other dogs. They’re in Palm Springs but have have to return to Canada in 2 weeks without her. Any takers in LA?? Can be driven to u! https://t.co/P2TEcL23PV",
            "tweet": "my great friends cynthia &amp; paul rodgers are fostering this perfect dog. super well mannered, small 35 pounds, 4 years old loves people, children &amp; other dogs. they’re in palm springs but have have to return to canada in 2 weeks without her. any takers in la?? can be driven to u! "
        },
        {
            "date": "2021-03-25 19:13:25+00:00",
            "tweet_raw": "Happy Birthday Sir Elton! I raise my glass to your stellar accomplishments both musical and as a humanitarian. Enjoy this day. @eltonofficial https://t.co/Vi3Fhqdtdk",
            "tweet": "happy birthday sir elton! i raise my glass to your stellar accomplishments both musical and as a humanitarian. enjoy this day.  "
        },
        {
            "date": "2021-02-12 18:42:58+00:00",
            "tweet_raw": "Nobody should be able to hide in anonymity behind the internet to mock or spread untruths. It’s the coward’s way. Point made. Now let’s move on. https://t.co/w53r0MvKXG",
            "tweet": "nobody should be able to hide in anonymity behind the internet to mock or spread untruths. it’s the coward’s way. point made. now let’s move on. "
        },
        {
            "date": "2021-06-27 21:04:38+00:00",
            "tweet_raw": "I’m REALLY proud of this A&amp;E special. A great “watch” for everyone and anyone. Thanks to Dave Grohl, Tom Morello, Bob Ezrin, Eddie Kramer and so many more. @foofighters @tmorello https://t.co/ypHEfAR13t",
            "tweet": "i’m really proud of this a&amp;e special. a great “watch” for everyone and anyone. thanks to dave grohl, tom morello, bob ezrin, eddie kramer and so many more.   "
        },
        {
            "date": "2021-03-16 03:35:27+00:00",
            "tweet_raw": "I've been watching Round 1 of the Hagler-Hearns fight since The Champ's death. Nothing will EVER match it. I miss the Golden Age of Boxing. https://t.co/rtxIK6KQsv",
            "tweet": "i've been watching round 1 of the hagler-hearns fight since the champ's death. nothing will ever match it. i miss the golden age of boxing. "
        },
        {
            "date": "2021-05-30 23:17:13+00:00",
            "tweet_raw": "Let’s all remember the meaning of this day is to honor and remember all who gave their lives for the love of this country and all it still strives to be. To the families and children that were left behind, My prayers, and bless the memory of the hero you lost #MemorialDayWeekend https://t.co/3oC3KZxspC",
            "tweet": "let’s all remember the meaning of this day is to honor and remember all who gave their lives for the love of this country and all it still strives to be. to the families and children that were left behind, my prayers, and bless the memory of the hero you lost  "
        },
        {
            "date": "2021-07-06 01:16:55+00:00",
            "tweet_raw": "Probably The Best News I’ve Read All Day. Let’s remove the stigma of life’s traumas &amp; mental illness. Those affected who live in fear &amp; isolation need to know they’re not alone &amp; there is help. EVERYONE’s illness calls for support &amp; empathy. @ArianaGrande  https://t.co/eFrhdTDooF",
            "tweet": "probably the best news i’ve read all day. let’s remove the stigma of life’s traumas &amp; mental illness. those affected who live in fear &amp; isolation need to know they’re not alone &amp; there is help. everyone’s illness calls for support &amp; empathy.   "
        },
        {
            "date": "2021-03-08 00:55:38+00:00",
            "tweet_raw": "FOUR opinions, FOUR tastes... ONE PIZZA! https://t.co/cInwHdFIg7",
            "tweet": "four opinions, four tastes... one pizza! "
        },
        {
            "date": "2021-06-08 18:54:56+00:00",
            "tweet_raw": "THANK YOU to my dear friend &amp; fantastic chef Julian Serrano. Great night/great dinner with Tommy and Eric at Lago. Terrific staff. Both Julian's Vegas restaurants, Picasso &amp; Lago are my faves. Who wouldn't love fine dining surrounded by original Picassos? @Bellagio @chefjserrano https://t.co/jKBfxjzHcF",
            "tweet": "thank you to my dear friend &amp; fantastic chef julian serrano. great night/great dinner with tommy and eric at lago. terrific staff. both julian's vegas restaurants, picasso &amp; lago are my faves. who wouldn't love fine dining surrounded by original picassos?   "
        },
        {
            "date": "2021-07-04 18:22:21+00:00",
            "tweet_raw": "Celebrate those who wrote the Declaration Of Independence &amp; all who still fight for the ideals of determining our own destiny. That was just the BEGINNING of a never ending challenge to build a country of equality &amp; justice for everyone. Times change, that challenge continues. https://t.co/o37EMsnSrN",
            "tweet": "celebrate those who wrote the declaration of independence &amp; all who still fight for the ideals of determining our own destiny. that was just the beginning of a never ending challenge to build a country of equality &amp; justice for everyone. times change, that challenge continues. "
        },
        {
            "date": "2021-04-18 00:23:09+00:00",
            "tweet_raw": "The Sun's Coming Out! So awesome to have lunch with my dear friend Bob Ezrin today. https://t.co/ViphDawI0y",
            "tweet": "the sun's coming out! so awesome to have lunch with my dear friend bob ezrin today. "
        },
        {
            "date": "2021-08-11 22:56:41+00:00",
            "tweet_raw": "YES. We’re booted up in rehearsal. The End Of The Road resumes Aug. 18th and we are READY! https://t.co/FAmquiN6ko",
            "tweet": "yes. we’re booted up in rehearsal. the end of the road resumes aug. 18th and we are ready! "
        },
        {
            "date": "2021-06-16 20:03:37+00:00",
            "tweet_raw": "Hey #KISSArmy! I will be co-hosting @TheTalkCBS on Thursday, 6/17 &amp; Friday 6/18 at 2 PM! TUNE-IN as I unmask our 50-year music career on @AETV's @Biography: KISStory! #KISSBio https://t.co/RCXoTumGic",
            "tweet": "hey ! i will be co-hosting  on thursday, 6/17 &amp; friday 6/18 at 2 pm! tune-in as i unmask our 50-year music career on 's : kisstory!  "
        },
        {
            "date": "2021-03-12 16:38:53+00:00",
            "tweet_raw": "I'll be chatting in a few minutes on my YouTube channel! Head on over &amp; stay for the premiere of the \"I, Oh, I\" video. https://t.co/54l2iooEvG https://t.co/Q3XmNF1R7y",
            "tweet": "i'll be chatting in a few minutes on my youtube channel! head on over &amp; stay for the premiere of the \"i, oh, i\" video.  "
        },
        {
            "date": "2021-03-05 13:28:56+00:00",
            "tweet_raw": "As much as #SoulStation is rooted in the past, I wanted our music to also live in the present. “I, Oh I” shows what can grow from those deep roots. With love &amp; respect we’re proud of where we come from &amp; where we’re going. The first of 5 originals! https://t.co/eush8VOjBa https://t.co/eHHKCGd0I1",
            "tweet": "as much as  is rooted in the past, i wanted our music to also live in the present. “i, oh i” shows what can grow from those deep roots. with love &amp; respect we’re proud of where we come from &amp; where we’re going. the first of 5 originals!  "
        },
        {
            "date": "2021-03-06 18:31:17+00:00",
            "tweet_raw": "RIP MICHAEL STANLEY... No relation to me, was a Cleveland legend. A musician &amp; songwriter who could pack arenas. He then transitioned into a radio personality. A bright light &amp; warm soul. His letter to his fans before his death says it all. Such grace. https://t.co/GFRBwQjDqh",
            "tweet": "rip michael stanley... no relation to me, was a cleveland legend. a musician &amp; songwriter who could pack arenas. he then transitioned into a radio personality. a bright light &amp; warm soul. his letter to his fans before his death says it all. such grace. "
        },
        {
            "date": "2021-09-05 17:26:50+00:00",
            "tweet_raw": "One of my closest friends Dell Furano has died after battling years of health struggles. He fought to the end because he loved his wife, family &amp; friends. He valued life &amp; lived it to the fullest. My love &amp; support to Kym and his entire wonderful family. https://t.co/LxOowfXUsY",
            "tweet": "one of my closest friends dell furano has died after battling years of health struggles. he fought to the end because he loved his wife, family &amp; friends. he valued life &amp; lived it to the fullest. my love &amp; support to kym and his entire wonderful family. "
        },
        {
            "date": "2021-04-01 17:00:19+00:00",
            "tweet_raw": "Tonight! https://t.co/MigmV9S8ax",
            "tweet": "tonight! "
        },
        {
            "date": "2021-05-20 21:42:33+00:00",
            "tweet_raw": "Sitting outside and ready to play for the coyotes, deer, birds, squirrels and YOU! Pulled out this Eastman AC922CE I love and it's the perfect day. What do you want to hear? https://t.co/M2nktwKLH1",
            "tweet": "sitting outside and ready to play for the coyotes, deer, birds, squirrels and you! pulled out this eastman ac922ce i love and it's the perfect day. what do you want to hear? "
        },
        {
            "date": "2021-04-22 02:29:28+00:00",
            "tweet_raw": "Edie... Your art is AWESOME!!! There is no such thing as doing art  “wrong”. There are only teachers who are wrong”!!! Your art shows amazing freedom and spirit. How can that be “wrong”?!?! Keep doing EXACTLY what you are doing. I LOVE it!!! https://t.co/PRwkYfN3ru",
            "tweet": "edie... your art is awesome!!! there is no such thing as doing art  “wrong”. there are only teachers who are wrong”!!! your art shows amazing freedom and spirit. how can that be “wrong”?!?! keep doing exactly what you are doing. i love it!!! "
        },
        {
            "date": "2022-04-07 21:49:05+00:00",
            "tweet_raw": "Today is my dad’s birthday. He would be 102 and he got close! Towards the end he told me we would always be together. He’s with me and I’m blessed that we left nothing unsaid. He’s 101 in this photo one year ago. https://t.co/keKWNgkUzb",
            "tweet": "today is my dad’s birthday. he would be 102 and he got close! towards the end he told me we would always be together. he’s with me and i’m blessed that we left nothing unsaid. he’s 101 in this photo one year ago. "
        },
        {
            "date": "2021-02-28 23:39:05+00:00",
            "tweet_raw": "WooHoo!!\nhttps://t.co/9MlWvSmLdF",
            "tweet": "woohoo!!\n"
        },
        {
            "date": "2021-07-09 19:15:50+00:00",
            "tweet_raw": "https://t.co/KgoGEIa9rf So glad to see the brothers back in top form. Chris continues to carry that torch of so many of the early greats\nand Rich lays it all down. LOVE it! @theblackcrowes",
            "tweet": " so glad to see the brothers back in top form. chris continues to carry that torch of so many of the early greats\nand rich lays it all down. love it! "
        },
        {
            "date": "2022-04-19 02:08:21+00:00",
            "tweet_raw": "Soundcheck Tonight. If you find something you love doing, you'll never work a day in your life.\nPhoto/Ross Halfin https://t.co/yVYPh5XkUA",
            "tweet": "soundcheck tonight. if you find something you love doing, you'll never work a day in your life.\nphoto/ross halfin "
        },
        {
            "date": "2021-06-19 08:01:54+00:00",
            "tweet_raw": "Things work out out as they’re meant to. Many years ago I lost touch with Kelsey Grammer, who I shared a strong connection with. I missed him &amp; couldn’t figure it out. I agreed to co-host @TheTalkCBS &amp; turns out Kelsey is a guest! So glad to reconnect &amp; pick up where we left off.",
            "tweet": "things work out out as they’re meant to. many years ago i lost touch with kelsey grammer, who i shared a strong connection with. i missed him &amp; couldn’t figure it out. i agreed to co-host  &amp; turns out kelsey is a guest! so glad to reconnect &amp; pick up where we left off."
        },
        {
            "date": "2021-07-25 18:30:22+00:00",
            "tweet_raw": "If we focus on the fact there IS good in this world, we can BE a part of that good. Changing the world starts with each one of us. https://t.co/NmigXicZQd",
            "tweet": "if we focus on the fact there is good in this world, we can be a part of that good. changing the world starts with each one of us. "
        },
        {
            "date": "2021-07-01 01:58:23+00:00",
            "tweet_raw": "When someone feigns sympathy by speaking of “your” truth they are actually saying they don’t believe you. SIXTY women came forward with basically identical accounts of being drugged &amp; raped. THAT is THE truth. Legal technicalities &amp; friendship with the rapist can’t change that. https://t.co/sMCRs3nq8e",
            "tweet": "when someone feigns sympathy by speaking of “your” truth they are actually saying they don’t believe you. sixty women came forward with basically identical accounts of being drugged &amp; raped. that is the truth. legal technicalities &amp; friendship with the rapist can’t change that. "
        },
        {
            "date": "2021-11-25 01:57:57+00:00",
            "tweet_raw": "Thanksgiving is tomorrow.Put aside the historical mythology &amp; this day can have great meaning. What do you have to be thankful for? Who are you helping have a better life? I’m blessed with my  health, my family, true friends &amp; you. Find your reasons for an attitude of gratitude.",
            "tweet": "thanksgiving is tomorrow.put aside the historical mythology &amp; this day can have great meaning. what do you have to be thankful for? who are you helping have a better life? i’m blessed with my  health, my family, true friends &amp; you. find your reasons for an attitude of gratitude."
        },
        {
            "date": "2021-07-13 05:42:27+00:00",
            "tweet_raw": "One BIG wall?... Four BIG paintings! https://t.co/HeuLmyUV2m",
            "tweet": "one big wall?... four big paintings! "
        },
        {
            "date": "2021-08-11 15:42:31+00:00",
            "tweet_raw": "Sarah, You have selflessly shared your struggle. 51.5 MILLION people in the US regardless of political views, ethnicity, religion or age also battle one form or other and degree of this illness. Please focus now on yourself and know that millions of good people are in your corner https://t.co/VB4zEUpgsD",
            "tweet": "sarah, you have selflessly shared your struggle. 51.5 million people in the us regardless of political views, ethnicity, religion or age also battle one form or other and degree of this illness. please focus now on yourself and know that millions of good people are in your corner "
        },
        {
            "date": "2021-03-01 23:00:32+00:00",
            "tweet_raw": "Front Page of Sunday’s San Diego Union Tribune-Arts and Culture Section. Thank you for a GREAT article and a Great review. Soul Station album out MARCH 19th. Another new track out THIS FRIDAY. https://t.co/VTJY4mew7I",
            "tweet": "front page of sunday’s san diego union tribune-arts and culture section. thank you for a great article and a great review. soul station album out march 19th. another new track out this friday. "
        },
        {
            "date": "2021-02-28 07:27:02+00:00",
            "tweet_raw": "HAPPY BIRTHDAY NEAL SCHON! My friend and guitar monster. Enjoy your day! @NealSchonMusic https://t.co/vmJe9NJ7vu",
            "tweet": "happy birthday neal schon! my friend and guitar monster. enjoy your day!  "
        },
        {
            "date": "2021-04-21 04:42:28+00:00",
            "tweet_raw": "Cooked up some fettuccine with olive oil, salt, tomatoes, onions, garlic, basil, hot sausage, mushrooms, white wine, butter, a little cream and spices. Just had to add parmigiano reggiano and Sarah and I ate it ALL! https://t.co/GdGeOHTe7J",
            "tweet": "cooked up some fettuccine with olive oil, salt, tomatoes, onions, garlic, basil, hot sausage, mushrooms, white wine, butter, a little cream and spices. just had to add parmigiano reggiano and sarah and i ate it all! "
        },
        {
            "date": "2021-03-01 23:00:32+00:00",
            "tweet_raw": "Front Page of Sunday’s San Diego Union Tribune-Arts and Culture Section. Thank you for a GREAT article and a Great review. Soul Station album out MARCH 19th. Another new track out THIS FRIDAY. https://t.co/VTJY4mew7I",
            "tweet": "front page of sunday’s san diego union tribune-arts and culture section. thank you for a great article and a great review. soul station album out march 19th. another new track out this friday. "
        },
        {
            "date": "2021-09-12 21:09:26+00:00",
            "tweet_raw": "To be clear… This is video of my friend Don McGee NOT Doc McGhee. https://t.co/ZDBpD61vox",
            "tweet": "to be clear… this is video of my friend don mcgee not doc mcghee. "
        },
        {
            "date": "2021-02-17 02:30:02+00:00",
            "tweet_raw": "“Bernadette” The Four Tops https://t.co/hLxKF9YtcF",
            "tweet": "“bernadette” the four tops "
        },
        {
            "date": "2021-07-11 20:08:31+00:00",
            "tweet_raw": "Last Night… Was an ugly display of Lack Of Humility, Lack Of Grace and Lack Of Sportsmanship.The writing is on the wall so please heal and come back so you can face it. https://t.co/2vS2qzQj7g",
            "tweet": "last night… was an ugly display of lack of humility, lack of grace and lack of sportsmanship.the writing is on the wall so please heal and come back so you can face it. "
        }
    ],
    "len": 100
}