{
    "account": "@sammyhagar",
    "type": "Rock",
    "tweets": [
        {
            "date": "2021-09-14 18:59:30+00:00",
            "tweet_raw": "Wow look at those two young men. It's hard to believe so much time has gone by, that was 1986, 35 years ago, holy shit. Even crazier that I used to trade off guitar licks back-and-forth with Eddie Van Halen on stage every night. ha Hah Hah Hah Hah Hah.... https://t.co/8gvKz5ICeL https://t.co/6QOZh8F9pb",
            "tweet": "wow look at those two young men. it's hard to believe so much time has gone by, that was 1986, 35 years ago, holy shit. even crazier that i used to trade off guitar licks back-and-forth with eddie van halen on stage every night. ha hah hah hah hah hah....  "
        },
        {
            "date": "2021-05-25 21:31:04+00:00",
            "tweet_raw": "More photos from the first show back! FL folks grab tickets while you can for upcoming shows at https://t.co/At6ukBJvl6\n\n📸: Jeremy Simmons https://t.co/Op3PDYlvC0",
            "tweet": "more photos from the first show back! fl folks grab tickets while you can for upcoming shows at \n\n📸: jeremy simmons "
        },
        {
            "date": "2022-03-28 17:31:23+00:00",
            "tweet_raw": "this Vegas residency is becoming another Cabo Wabo birthday bash experience. soooooo much fun. \nthank you to all the fans that made it, and the special guess you were all awesome\nsammy \nhttps://t.co/6XMQRz6uWF\n@litaford @Tromboneshorty",
            "tweet": "this vegas residency is becoming another cabo wabo birthday bash experience. soooooo much fun. \nthank you to all the fans that made it, and the special guess you were all awesome\nsammy \n\n "
        },
        {
            "date": "2021-04-20 16:00:01+00:00",
            "tweet_raw": "I lost my voice at the Cotton Bowl monsters of rock show in 1988? and I told the audience of over (70k) we would come back and do a free show. We did, in the streets of Dallas. It was awesome #DallasTexas #VanHagar\n📸: @8trackguy https://t.co/aP8uB6bE1N",
            "tweet": "i lost my voice at the cotton bowl monsters of rock show in 1988? and i told the audience of over (70k) we would come back and do a free show. we did, in the streets of dallas. it was awesome  \n📸:  "
        },
        {
            "date": "2021-05-20 22:23:12+00:00",
            "tweet_raw": "Taylor Hawkins just sent me that old Instagram post of Bill Clinton &amp; I when we turn 70 if you haven't seen it look it up it's funny. here's what he got in return. just finished rehearsing in Fort Lauderdale. The band sounded so fucking good today got some deep tracks for you https://t.co/evuCgQiiIq",
            "tweet": "taylor hawkins just sent me that old instagram post of bill clinton &amp; i when we turn 70 if you haven't seen it look it up it's funny. here's what he got in return. just finished rehearsing in fort lauderdale. the band sounded so fucking good today got some deep tracks for you "
        },
        {
            "date": "2021-12-22 01:04:42+00:00",
            "tweet_raw": "No sooner winter is here then it's over. #wintersolstice #summertime #beautiful https://t.co/l4xLHhjwFU",
            "tweet": "no sooner winter is here then it's over.    "
        },
        {
            "date": "2021-07-31 18:27:52+00:00",
            "tweet_raw": "Everything I do - I love to do”\n\nCheck out Sammy’s IG Live with @geoffedgers for the @washingtonpost! In this hour-long conversation, they dive deep into setlists, Van Hagar, turning vegas into the Cabo Wabo, music, and more: https://t.co/IpXnTHKQoZ",
            "tweet": "everything i do - i love to do”\n\ncheck out sammy’s ig live with  for the ! in this hour-long conversation, they dive deep into setlists, van hagar, turning vegas into the cabo wabo, music, and more: "
        },
        {
            "date": "2022-04-30 17:20:02+00:00",
            "tweet_raw": "last night Beale Street in Music Festival and #MemphisTennessee was off the charts more later from The Circle’s performance @DirtyHoneyBand https://t.co/hzlZX6x3IZ",
            "tweet": "last night beale street in music festival and  was off the charts more later from the circle’s performance  "
        },
        {
            "date": "2021-03-24 15:59:44+00:00",
            "tweet_raw": "We're celebrating 35 years of '5150'! A friend sent me this clip, I believe from a show in Europe? When I listened to the sincerity in my voice, it brought back some beautiful memories of sitting on the side of the stage, having a nice cold one, &amp; listening to the man himself. https://t.co/nvwXawGfYc",
            "tweet": "we're celebrating 35 years of '5150'! a friend sent me this clip, i believe from a show in europe? when i listened to the sincerity in my voice, it brought back some beautiful memories of sitting on the side of the stage, having a nice cold one, &amp; listening to the man himself. "
        },
        {
            "date": "2021-06-29 20:02:03+00:00",
            "tweet_raw": "\"Sammy Hagar is already on top of the world in the ever-crowded celebrity spirits competition. For his next number, he's joining the ready-to-drink cocktail party.\"\nCOMING THIS FALL! Introducing Sammy’s Beach Bar Cocktail Co! https://t.co/azrVXHY0hG",
            "tweet": "\"sammy hagar is already on top of the world in the ever-crowded celebrity spirits competition. for his next number, he's joining the ready-to-drink cocktail party.\"\ncoming this fall! introducing sammy’s beach bar cocktail co! "
        },
        {
            "date": "2022-05-01 21:23:33+00:00",
            "tweet_raw": "2/3 'Let's just go play music and you're at a big ass Circle party for those people, just do what we do!' Then with Dave Grohl's blessings we decided to do a broken down version of one of my favorite songs from one of my favorite bands.  No rehearsal",
            "tweet": "2/3 'let's just go play music and you're at a big ass circle party for those people, just do what we do!' then with dave grohl's blessings we decided to do a broken down version of one of my favorite songs from one of my favorite bands.  no rehearsal"
        },
        {
            "date": "2021-05-12 19:10:53+00:00",
            "tweet_raw": "This is one of the most informative articles about Cabo Wabo history I've seen. It brought back a lot of good memories #ILoveCabo #31YearsAndStillRocking \n\nCheck out the piece from Cabo Living Magazine here: \nhttps://t.co/kPKpWZRU5S https://t.co/tsgzJ9E8O6",
            "tweet": "this is one of the most informative articles about cabo wabo history i've seen. it brought back a lot of good memories   \n\ncheck out the piece from cabo living magazine here: \n "
        },
        {
            "date": "2021-05-05 16:13:02+00:00",
            "tweet_raw": "Give us your biggest Redrocker WOO for Cinco de Mayo! Whether you're whippin' up a Passion Fruit &amp; Charred Jalapeño Margarita w/ some @santo_spirit Mezquila, or a Cinco De Cinco w/ @sammysrum, get your fiesta on!\nRecipes here:\nhttps://t.co/rfD3jul6EQ\nhttps://t.co/olyQHsmmBA https://t.co/IijGhmcXkG",
            "tweet": "give us your biggest redrocker woo for cinco de mayo! whether you're whippin' up a passion fruit &amp; charred jalapeño margarita w/ some  mezquila, or a cinco de cinco w/ , get your fiesta on!\nrecipes here:\n\n "
        },
        {
            "date": "2021-09-15 17:48:21+00:00",
            "tweet_raw": "Cheers to 6 years since the release of \"Are We Having Any Fun Yet?\", the cooking and partying handbook! Maybe it’s time for an update! Any suggestions for some new @santo_spirit and Sammy's Beach Bar Cocktail Company drink pairings ? 🥂🥂 https://t.co/ayiwsQLiok",
            "tweet": "cheers to 6 years since the release of \"are we having any fun yet?\", the cooking and partying handbook! maybe it’s time for an update! any suggestions for some new  and sammy's beach bar cocktail company drink pairings ? 🥂🥂 "
        },
        {
            "date": "2021-07-30 23:56:48+00:00",
            "tweet_raw": "Just 3 more days to enter @santo_spirit's National Tequila Day Giveaway! Head on over to Santo's Instagram page and follow all the steps for the chance to win some EPIC prizes. Enter now - https://t.co/9Kuudzkdqj https://t.co/Ptr9Sy17PW",
            "tweet": "just 3 more days to enter 's national tequila day giveaway! head on over to santo's instagram page and follow all the steps for the chance to win some epic prizes. enter now -  "
        },
        {
            "date": "2021-06-24 00:24:13+00:00",
            "tweet_raw": "Happy 34th anniversary to 'I Never Said Goodbye'! \nCelebrate with the music video for \"Hands and Knees\". The brain machine was some wacky invention: you could actually lose track of time after a few minutes on this thing. Very psychedelic. https://t.co/XIh0YhykZy",
            "tweet": "happy 34th anniversary to 'i never said goodbye'! \ncelebrate with the music video for \"hands and knees\". the brain machine was some wacky invention: you could actually lose track of time after a few minutes on this thing. very psychedelic. "
        },
        {
            "date": "2021-05-13 17:31:40+00:00",
            "tweet_raw": "Happy #WorldCocktail day from your favorite brothers from another mother 🥂🎉 Whip up my favorite Santo Spirit drink, the Passion Fruit and Charred Jalepeño Margarita, and celebrate! https://t.co/YG7tYHhXfC https://t.co/AjjOawXPd3",
            "tweet": "happy  day from your favorite brothers from another mother 🥂🎉 whip up my favorite santo spirit drink, the passion fruit and charred jalepeño margarita, and celebrate!  "
        },
        {
            "date": "2021-05-04 17:55:26+00:00",
            "tweet_raw": "ha ha 1988-ish some crazy photographer decided to shoot us in the shower. at the end of the shoot we turned the showers on full - I wonder where that photo is! #OU812 https://t.co/e6Nr8d1ary",
            "tweet": "ha ha 1988-ish some crazy photographer decided to shoot us in the shower. at the end of the shoot we turned the showers on full - i wonder where that photo is!  "
        },
        {
            "date": "2021-07-17 20:31:06+00:00",
            "tweet_raw": "Festival of the Lakes are you ready to party? 🤘  We can't wait to rock with you tonight! \n📸: Jonathan Graves https://t.co/P44O93Yp0C",
            "tweet": "festival of the lakes are you ready to party? 🤘  we can't wait to rock with you tonight! \n📸: jonathan graves "
        },
        {
            "date": "2022-03-22 22:15:00+00:00",
            "tweet_raw": "Vegas VIP Readheads: we'll see you soon!\nIf you have VIP tickets for the upcoming shows at @stratvegas, here's a reminder about our arrival times. VIP Packages are sold out, but there are still a limited number of tickets left, get 'em before they're gone: https://t.co/vcVifbtzxs",
            "tweet": "vegas vip readheads: we'll see you soon!\nif you have vip tickets for the upcoming shows at , here's a reminder about our arrival times. vip packages are sold out, but there are still a limited number of tickets left, get 'em before they're gone: "
        },
        {
            "date": "2021-07-08 21:01:20+00:00",
            "tweet_raw": "RIP Claudio Zampolli: a genius mechanic. Especially Italian high-performance engines. He got me my 512 Boxer (“I Can’t Drive 55” car), my first new Ferrari, % many more after that. He's the mechanic in the \"I Can't Drive 55\" video. Read the full blog here: https://t.co/89435QdK1a https://t.co/gVKzffDcwJ",
            "tweet": "rip claudio zampolli: a genius mechanic. especially italian high-performance engines. he got me my 512 boxer (“i can’t drive 55” car), my first new ferrari, % many more after that. he's the mechanic in the \"i can't drive 55\" video. read the full blog here:  "
        },
        {
            "date": "2021-09-20 23:02:40+00:00",
            "tweet_raw": "Check out the @ocregister's piece about the @afterburnerfest, Pacific Airshow, Birthday Bash and more! https://t.co/0uKd7QU39p",
            "tweet": "check out the 's piece about the , pacific airshow, birthday bash and more! "
        },
        {
            "date": "2021-05-01 21:08:48+00:00",
            "tweet_raw": "While ‘Nine on a Ten Scale’ was Sammy’s debut solo record, it was full of guests helping out. The iconic @OfficialTOPBand was among them, &amp; bandleader Emilio Castillo shared this video to help celebrate! Visit https://t.co/NtT1WkM9qD for new memories Sammy has shared. https://t.co/jLkAtVh4jX",
            "tweet": "while ‘nine on a ten scale’ was sammy’s debut solo record, it was full of guests helping out. the iconic  was among them, &amp; bandleader emilio castillo shared this video to help celebrate! visit  for new memories sammy has shared. "
        },
        {
            "date": "2021-05-22 22:12:12+00:00",
            "tweet_raw": "“So now you are giving back to a good cause in a beautiful, safe setting and seeing multi-platinum artists. Already the night is a major triumph. But also making it so successful is the feeling of community.”\n\nhttps://t.co/Ptdhu059xz",
            "tweet": "“so now you are giving back to a good cause in a beautiful, safe setting and seeing multi-platinum artists. already the night is a major triumph. but also making it so successful is the feeling of community.”\n\n"
        },
        {
            "date": "2021-08-09 22:54:34+00:00",
            "tweet_raw": "#ICYMI: Check out Sammy's interview with Geoff Edgers for @washingtonpost! The two chat about everything from Montrose to Van Hagar. \nhttps://t.co/r9p7jio5Bz",
            "tweet": ": check out sammy's interview with geoff edgers for ! the two chat about everything from montrose to van hagar. \n"
        },
        {
            "date": "2021-04-04 06:03:13+00:00",
            "tweet_raw": "I want to be like this guy when I grow up! #HappyEaster #100birthday #100YearsOld https://t.co/hmUHI6ULMz",
            "tweet": "i want to be like this guy when i grow up!    "
        },
        {
            "date": "2021-09-08 01:09:20+00:00",
            "tweet_raw": "Mick Brigden was the first person that took care of me on the road. Montrose opened for Humble Pie for the 3 years we were on the road. Mick was their tour manager, lighting director, stage manager, seemed like he did everything. RIP Mick, read full post:\nhttps://t.co/K7Z7ZiWNpH https://t.co/2vT5RrVl1b",
            "tweet": "mick brigden was the first person that took care of me on the road. montrose opened for humble pie for the 3 years we were on the road. mick was their tour manager, lighting director, stage manager, seemed like he did everything. rip mick, read full post:\n "
        },
        {
            "date": "2021-10-13 18:28:02+00:00",
            "tweet_raw": "I've received hundreds of birthday wishes this morning that are heartfelt and beautiful but this one is so special to me. This young lady is a guitar player and a singer in Afghanistan. She is not free to do something as simple as play guitar and sing. https://t.co/Fd2I8r7Rp3",
            "tweet": "i've received hundreds of birthday wishes this morning that are heartfelt and beautiful but this one is so special to me. this young lady is a guitar player and a singer in afghanistan. she is not free to do something as simple as play guitar and sing. "
        },
        {
            "date": "2021-03-24 15:59:44+00:00",
            "tweet_raw": "We're celebrating 35 years of '5150'! A friend sent me this clip, I believe from a show in Europe? When I listened to the sincerity in my voice, it brought back some beautiful memories of sitting on the side of the stage, having a nice cold one, &amp; listening to the man himself. https://t.co/nvwXawGfYc",
            "tweet": "we're celebrating 35 years of '5150'! a friend sent me this clip, i believe from a show in europe? when i listened to the sincerity in my voice, it brought back some beautiful memories of sitting on the side of the stage, having a nice cold one, &amp; listening to the man himself. "
        },
        {
            "date": "2021-09-20 00:15:35+00:00",
            "tweet_raw": "This Wednesday, Sept 22, get ready to party🥂 We’re celebrating Sammy’s Beach Bar Cocktail Co with a rooftop performance @ the Paris hotel on the Vegas strip. Free concert @ 6:30 PM, listen from the street, your hotel, or the Cabo Wabo 🎸 beginning of Libra fest 2021 let’s go https://t.co/Y8QK14BHoH",
            "tweet": "this wednesday, sept 22, get ready to party🥂 we’re celebrating sammy’s beach bar cocktail co with a rooftop performance @ the paris hotel on the vegas strip. free concert @ 6:30 pm, listen from the street, your hotel, or the cabo wabo 🎸 beginning of libra fest 2021 let’s go "
        },
        {
            "date": "2021-05-20 22:23:12+00:00",
            "tweet_raw": "Taylor Hawkins just sent me that old Instagram post of Bill Clinton &amp; I when we turn 70 if you haven't seen it look it up it's funny. here's what he got in return. just finished rehearsing in Fort Lauderdale. The band sounded so fucking good today got some deep tracks for you https://t.co/evuCgQiiIq",
            "tweet": "taylor hawkins just sent me that old instagram post of bill clinton &amp; i when we turn 70 if you haven't seen it look it up it's funny. here's what he got in return. just finished rehearsing in fort lauderdale. the band sounded so fucking good today got some deep tracks for you "
        },
        {
            "date": "2021-05-20 19:50:16+00:00",
            "tweet_raw": "Happy 24th anniversary to Sammy's 1st post-Van Halen solo album, 'Marching To Mars'! In a '97 interview with Vogelism Sammy said \"I have exposed a lot more of myself, the true Sammy Hagar. Marching To Mars, in my opinion, is the closest to who I really am\"\nhttps://t.co/wJg7keFWuI https://t.co/PDccHpKr4t",
            "tweet": "happy 24th anniversary to sammy's 1st post-van halen solo album, 'marching to mars'! in a '97 interview with vogelism sammy said \"i have exposed a lot more of myself, the true sammy hagar. marching to mars, in my opinion, is the closest to who i really am\"\n "
        },
        {
            "date": "2021-09-18 20:30:39+00:00",
            "tweet_raw": "gettin ready for the big 4 bashes. it's libra time. it's party time. #vegas #huntingtonbeach #catalina #vegasresidency #redheadshavemorefun https://t.co/aXD1ndboWE",
            "tweet": "gettin ready for the big 4 bashes. it's libra time. it's party time.      "
        },
        {
            "date": "2021-04-17 16:35:54+00:00",
            "tweet_raw": "Sammy gets optimistic in this week’s episode of Top Rock Countdown! Don’t miss out on the good vibes-- tune into your local rock radio station: https://t.co/CSljzMJA7C https://t.co/tBiIk0bLVq",
            "tweet": "sammy gets optimistic in this week’s episode of top rock countdown! don’t miss out on the good vibes-- tune into your local rock radio station:  "
        },
        {
            "date": "2021-04-29 16:32:21+00:00",
            "tweet_raw": "It's tough being an opening act #HoustonTexas #1979 #TBT Opening for #Boston https://t.co/84G1RNO0KQ",
            "tweet": "it's tough being an opening act    opening for  "
        },
        {
            "date": "2021-09-20 00:15:35+00:00",
            "tweet_raw": "This Wednesday, Sept 22, get ready to party🥂 We’re celebrating Sammy’s Beach Bar Cocktail Co with a rooftop performance @ the Paris hotel on the Vegas strip. Free concert @ 6:30 PM, listen from the street, your hotel, or the Cabo Wabo 🎸 beginning of Libra fest 2021 let’s go https://t.co/Y8QK14BHoH",
            "tweet": "this wednesday, sept 22, get ready to party🥂 we’re celebrating sammy’s beach bar cocktail co with a rooftop performance @ the paris hotel on the vegas strip. free concert @ 6:30 pm, listen from the street, your hotel, or the cabo wabo 🎸 beginning of libra fest 2021 let’s go "
        },
        {
            "date": "2021-03-21 18:51:43+00:00",
            "tweet_raw": "Sammy and @rickspringfield are talking rum, Catalina Island, collaborations, and more in @Forbes’ Sunday Conversation. Check it out!\n\nhttps://t.co/AyvgrMMgZO",
            "tweet": "sammy and  are talking rum, catalina island, collaborations, and more in ’ sunday conversation. check it out!\n\n"
        },
        {
            "date": "2021-06-14 19:53:08+00:00",
            "tweet_raw": "I know what I was drinking but what was I thinking @NASCAR  #backtothefuture #funnyshit #iwasntdriving #bloopers #oops https://t.co/AVy6Aizc9T",
            "tweet": "i know what i was drinking but what was i thinking        "
        },
        {
            "date": "2021-06-03 20:16:29+00:00",
            "tweet_raw": "Check out the newest episode of @justbpodcast! Sammy chats with @Bethenny about creating his brand, being successful in the alcohol business, his passion for helping others, &amp; so much more. \n\nListen on the @iHeartRadio App, @ApplePodcasts, or wherever you get your podcasts. https://t.co/z1Ootu8UjP",
            "tweet": "check out the newest episode of ! sammy chats with  about creating his brand, being successful in the alcohol business, his passion for helping others, &amp; so much more. \n\nlisten on the  app, , or wherever you get your podcasts. "
        },
        {
            "date": "2021-04-08 17:00:02+00:00",
            "tweet_raw": "Boy does this bring back some memories, my first headline show #TBT #Winterland #SanFrancisco #1973 https://t.co/oQoE7JiBwT",
            "tweet": "boy does this bring back some memories, my first headline show     "
        },
        {
            "date": "2021-04-01 16:49:48+00:00",
            "tweet_raw": "Happy birthday to my first daughter. 25 years ago on this very special day Kama Took her first breath. To Kari and I it felt like we were witnessing a miracle. https://t.co/BBGqaYtOct",
            "tweet": "happy birthday to my first daughter. 25 years ago on this very special day kama took her first breath. to kari and i it felt like we were witnessing a miracle. "
        },
        {
            "date": "2021-06-11 22:00:01+00:00",
            "tweet_raw": "Double the countdown, double the fun on this weekend's Top Rock Countdown! Sammy's bringing you not one, but two lists in his newest episode - \"Songs I Wish I Wrote / Opening Tracks\". Don't miss it! https://t.co/CSljzN1bwc https://t.co/T4sGXYwcoO",
            "tweet": "double the countdown, double the fun on this weekend's top rock countdown! sammy's bringing you not one, but two lists in his newest episode - \"songs i wish i wrote / opening tracks\". don't miss it!  "
        },
        {
            "date": "2022-02-07 00:46:52+00:00",
            "tweet_raw": "Doing what needs to be done. #theotherhalf #thecircle #vegas @stratvegas https://t.co/2qVKT7N4wx",
            "tweet": "doing what needs to be done.     "
        },
        {
            "date": "2021-07-01 18:04:37+00:00",
            "tweet_raw": "You asked, so we delivered! Announcing TWO NEW Vegas Residency shows at The STRAT Las Vegas  - November 12th and 13th. Due to extraordinary pre-sale ticket demand and the first two weekends of shows selling out in just two hours, we've added two new dates (1/2) https://t.co/QlUwCVnE7s",
            "tweet": "you asked, so we delivered! announcing two new vegas residency shows at the strat las vegas  - november 12th and 13th. due to extraordinary pre-sale ticket demand and the first two weekends of shows selling out in just two hours, we've added two new dates (1/2) "
        },
        {
            "date": "2021-04-19 14:47:55+00:00",
            "tweet_raw": "Cheers @Bethenny for bad a** cocktail shaker. Great fun chatting on your Podcast. Next time over our cocktails. https://t.co/ib0MJ6meJ7",
            "tweet": "cheers  for bad a** cocktail shaker. great fun chatting on your podcast. next time over our cocktails. "
        },
        {
            "date": "2022-01-11 19:55:49+00:00",
            "tweet_raw": "\"Come Hades or high water, on the Strip or in Cabo, Sammy Hagar brings the party.\" \n\nWe're bringing the party back to Vegas! Read the Las Vegas @reviewjournal's latest piece by @johnnykats about the return of Sammy Hagar and Friends at the Strat: https://t.co/aWUNSf2wBo",
            "tweet": "\"come hades or high water, on the strip or in cabo, sammy hagar brings the party.\" \n\nwe're bringing the party back to vegas! read the las vegas 's latest piece by  about the return of sammy hagar and friends at the strat: "
        },
        {
            "date": "2021-10-14 23:39:20+00:00",
            "tweet_raw": "welcome to Cabo San Lucas. And the  continuation of the bash. #SammyHagarInternational #cabowabo #friday #saturday #free like the good all days https://t.co/JTw87mHXZ3",
            "tweet": "welcome to cabo san lucas. and the  continuation of the bash.      like the good all days "
        },
        {
            "date": "2021-09-16 16:21:27+00:00",
            "tweet_raw": "“Hippies and Musicians Use Back Door” ???  — took a short break and we got locked out of RCA Studios in Nashville! You can’t stop this music - we’ll get back in and continue working on the new Circle album! https://t.co/P4kVEPyRUR",
            "tweet": "“hippies and musicians use back door” ???  — took a short break and we got locked out of rca studios in nashville! you can’t stop this music - we’ll get back in and continue working on the new circle album! "
        },
        {
            "date": "2021-10-27 17:59:49+00:00",
            "tweet_raw": "ALL guests should visit the CheckVax site and complete your CheckVax pass validation ahead of the show for faster entry. To get started, visit the CheckVax site for free here: https://t.co/QxvG4IpUbE",
            "tweet": "all guests should visit the checkvax site and complete your checkvax pass validation ahead of the show for faster entry. to get started, visit the checkvax site for free here: "
        },
        {
            "date": "2021-07-07 16:08:05+00:00",
            "tweet_raw": "As much as I love to play guitar, when you got a guy like Vic Johnson on your team you will always be the second guitarist!!! ❤️🤟🥂 my brother.",
            "tweet": "as much as i love to play guitar, when you got a guy like vic johnson on your team you will always be the second guitarist!!! ❤️🤟🥂 my brother."
        },
        {
            "date": "2021-03-12 01:22:04+00:00",
            "tweet_raw": "Sammy's always happy to support his longtime friends @ \n@KSHE95! Catch him as a guest during tomorrow's @keeplivealives1 event. The fundraiser supports St Louis entertainment industry professionals who've been struggling due to loss of work w/ the pandemic https://t.co/3xdIOuBCNG https://t.co/3AVGZrnppZ",
            "tweet": "sammy's always happy to support his longtime friends @ \n! catch him as a guest during tomorrow's  event. the fundraiser supports st louis entertainment industry professionals who've been struggling due to loss of work w/ the pandemic  "
        },
        {
            "date": "2021-03-20 17:00:00+00:00",
            "tweet_raw": "This week marks 27 years since 'Unboxed! The album is a collection of Sammy's top hits with 2 unreleased songs, “High Hopes” &amp; “Buying My Way Into Heaven.\" From the rowdy vocals of \"I Can't Drive 55\" to the slower \"Give to Live,\" 'Unboxed' features Sammy's best work in one place. https://t.co/j8sypAydTM",
            "tweet": "this week marks 27 years since 'unboxed! the album is a collection of sammy's top hits with 2 unreleased songs, “high hopes” &amp; “buying my way into heaven.\" from the rowdy vocals of \"i can't drive 55\" to the slower \"give to live,\" 'unboxed' features sammy's best work in one place. "
        },
        {
            "date": "2021-07-06 20:08:03+00:00",
            "tweet_raw": "New show alert! 🎸 The Circle will be playing @AgoraCLE on 8/15 - a benefit for the Akron Children's Hospital &amp; local food banks. Pre-sale begins Thursday @ 10 AM EST w/ code \"RED\", general on sale Friday @ 12PM EST:\nhttps://t.co/cTcixhVRE1\n#akronchildrenshospital #akronfoodbank https://t.co/M4A49lBfVm",
            "tweet": "new show alert! 🎸 the circle will be playing  on 8/15 - a benefit for the akron children's hospital &amp; local food banks. pre-sale begins thursday @ 10 am est w/ code \"red\", general on sale friday @ 12pm est:\n\n  "
        },
        {
            "date": "2022-03-05 13:47:16+00:00",
            "tweet_raw": "suckers walk money talks #sammyandthecircle #florida #Rehearsal https://t.co/niYFecMzcC",
            "tweet": "suckers walk money talks    "
        },
        {
            "date": "2021-07-01 18:04:38+00:00",
            "tweet_raw": "Pre-sale starts tomorrow @ 10 AM PST-Make sure you're subscribed to Sammy's email list to be the first to know the code: https://t.co/BWNsdNbnWL \nAdditional shows for 2022 will be announced shortly! \nPublic on sale is on Saturday, July 3 @ 10 AM PT @ https://t.co/a1nEcc8IlZ (2/2)",
            "tweet": "pre-sale starts tomorrow @ 10 am pst-make sure you're subscribed to sammy's email list to be the first to know the code:  \nadditional shows for 2022 will be announced shortly! \npublic on sale is on saturday, july 3 @ 10 am pt @  (2/2)"
        },
        {
            "date": "2021-06-24 22:54:55+00:00",
            "tweet_raw": "Tune into @CNN's \"Fourth in America Special\" to celebrate the reopening of the country and Independence day. The special live July 4th prime-time program will feature fireworks and musical performances, including the Circle! 🇺🇸 \nhttps://t.co/9rTGP3vojz",
            "tweet": "tune into 's \"fourth in america special\" to celebrate the reopening of the country and independence day. the special live july 4th prime-time program will feature fireworks and musical performances, including the circle! 🇺🇸 \n"
        },
        {
            "date": "2021-06-18 23:32:37+00:00",
            "tweet_raw": "Hear \"Boom Boom\" Mancini tell the story behind the name, \"For Unlawful Carnal Knowledge\" 🥊 https://t.co/rcMDOhSzZq",
            "tweet": "hear \"boom boom\" mancini tell the story behind the name, \"for unlawful carnal knowledge\" 🥊 "
        },
        {
            "date": "2021-09-01 18:05:18+00:00",
            "tweet_raw": "Come on, catch me if you can in my Trans Am 🏎️ \nToday we're celebrating 42 years of 'Street Machine'! Rev up your engines, turn your speakers up, and celebrate the record with the 2002 remaster of \"Plain Jane\" 🤘\nhttps://t.co/yJrAXbm393 https://t.co/W5UjLCeEXV",
            "tweet": "come on, catch me if you can in my trans am 🏎️ \ntoday we're celebrating 42 years of 'street machine'! rev up your engines, turn your speakers up, and celebrate the record with the 2002 remaster of \"plain jane\" 🤘\n "
        },
        {
            "date": "2022-05-10 16:22:33+00:00",
            "tweet_raw": "just like the dressing room, I love having friends on the show, staying at the same hotel it seems to keep things interesting #haha @kcreospeedwagon #singers #laughlin https://t.co/lMvWprmELI",
            "tweet": "just like the dressing room, i love having friends on the show, staying at the same hotel it seems to keep things interesting     "
        },
        {
            "date": "2021-03-05 18:35:36+00:00",
            "tweet_raw": "Messing around on the Red Rocker mountain bike, May '89!\n\nPhoto by @jayblakesberg for @RollingStone. https://t.co/zn2bJMw0G6",
            "tweet": "messing around on the red rocker mountain bike, may '89!\n\nphoto by  for . "
        },
        {
            "date": "2021-04-21 14:36:26+00:00",
            "tweet_raw": "oh boy Mikey hooking up thankfully in the neighborhood. #bestbuddies #thecircle #happypeople #theotherhalf #mastequila https://t.co/A2DqCmJkLf",
            "tweet": "oh boy mikey hooking up thankfully in the neighborhood.      "
        },
        {
            "date": "2021-08-12 19:43:06+00:00",
            "tweet_raw": "Listen up Texas! @Specs1962 is stocked up with @sammysrum 🥂 I’m so excited about this one. Find a bottle in your local store! #beachbarrum #rumseason #beachlife #createyourownparadise https://t.co/egCTFbffcV",
            "tweet": "listen up texas!  is stocked up with  🥂 i’m so excited about this one. find a bottle in your local store!     "
        },
        {
            "date": "2021-06-17 20:01:47+00:00",
            "tweet_raw": "Back with another show announcement! We'll be playing the Choctaw Grand Theater in Durant, OK on 9/10 - pre-sale starts 6/24 at 9 AM CDT with code \"REDHEAD\" 🤘 https://t.co/At6ukBJvl6\n\n📸: Leah Steiger https://t.co/TnGt78B4ot",
            "tweet": "back with another show announcement! we'll be playing the choctaw grand theater in durant, ok on 9/10 - pre-sale starts 6/24 at 9 am cdt with code \"redhead\" 🤘 \n\n📸: leah steiger "
        },
        {
            "date": "2021-06-24 00:24:13+00:00",
            "tweet_raw": "Happy 34th anniversary to 'I Never Said Goodbye'! \nCelebrate with the music video for \"Hands and Knees\". The brain machine was some wacky invention: you could actually lose track of time after a few minutes on this thing. Very psychedelic. https://t.co/XIh0YhykZy",
            "tweet": "happy 34th anniversary to 'i never said goodbye'! \ncelebrate with the music video for \"hands and knees\". the brain machine was some wacky invention: you could actually lose track of time after a few minutes on this thing. very psychedelic. "
        },
        {
            "date": "2021-08-23 20:59:21+00:00",
            "tweet_raw": "After the purchase window closes (8/28), a limited number of single day tickets will be made available. More details to come.",
            "tweet": "after the purchase window closes (8/28), a limited number of single day tickets will be made available. more details to come."
        },
        {
            "date": "2021-07-07 16:08:04+00:00",
            "tweet_raw": "Happy birthday to my right hand man, my left hand man just plain old main man Vic Johnson. Big walked into my studio in 1996. Played \"Rock Candy,\" \"Three Lockbox,\" and \"Finish What You Started.\" We shook hands and 25 years later we are still rockin together. https://t.co/HKX9RPTGSG",
            "tweet": "happy birthday to my right hand man, my left hand man just plain old main man vic johnson. big walked into my studio in 1996. played \"rock candy,\" \"three lockbox,\" and \"finish what you started.\" we shook hands and 25 years later we are still rockin together. "
        },
        {
            "date": "2021-10-27 00:02:53+00:00",
            "tweet_raw": "\"Nobody is going to hear the same thing twice.\" \nWe're just days away from the first show of the Strat Residency! Check out this piece from @LasVegasMag to hear Sammy chat about canned cocktails, bringing Cabo to Vegas and more: https://t.co/e0xN5P5BpC",
            "tweet": "\"nobody is going to hear the same thing twice.\" \nwe're just days away from the first show of the strat residency! check out this piece from  to hear sammy chat about canned cocktails, bringing cabo to vegas and more: "
        },
        {
            "date": "2021-07-09 17:58:31+00:00",
            "tweet_raw": "New music on the way? 👀  Check out the interview with @UltClassicRock: https://t.co/MlB5KTNbmo",
            "tweet": "new music on the way? 👀  check out the interview with : "
        },
        {
            "date": "2021-03-12 17:00:02+00:00",
            "tweet_raw": "I dislike shots as much as anyone. But I want to get back to playing live concerts, traveling the world without putting anyone at any risk my family my friends and myself Included. #2shot #moderna #bettersafethansorry #letitrock https://t.co/CnyjV3WVH4",
            "tweet": "i dislike shots as much as anyone. but i want to get back to playing live concerts, traveling the world without putting anyone at any risk my family my friends and myself included.     "
        },
        {
            "date": "2021-05-20 19:50:16+00:00",
            "tweet_raw": "Happy 24th anniversary to Sammy's 1st post-Van Halen solo album, 'Marching To Mars'! In a '97 interview with Vogelism Sammy said \"I have exposed a lot more of myself, the true Sammy Hagar. Marching To Mars, in my opinion, is the closest to who I really am\"\nhttps://t.co/wJg7keFWuI https://t.co/PDccHpKr4t",
            "tweet": "happy 24th anniversary to sammy's 1st post-van halen solo album, 'marching to mars'! in a '97 interview with vogelism sammy said \"i have exposed a lot more of myself, the true sammy hagar. marching to mars, in my opinion, is the closest to who i really am\"\n "
        },
        {
            "date": "2021-03-15 16:00:00+00:00",
            "tweet_raw": "I always loved this song written &amp; recorded by Moon Martin, taken to the top by the one &amp; only Mr. Robert Palmer. As we continue our @ Home Sessions, we hope to be able to bring it to you live in 2021 #FingersCrossed #DoctorOrders #TheCure #LiveRockAndRoll https://t.co/E96Dh9yCOj",
            "tweet": "i always loved this song written &amp; recorded by moon martin, taken to the top by the one &amp; only mr. robert palmer. as we continue our @ home sessions, we hope to be able to bring it to you live in 2021     "
        },
        {
            "date": "2021-09-08 01:09:20+00:00",
            "tweet_raw": "Mick Brigden was the first person that took care of me on the road. Montrose opened for Humble Pie for the 3 years we were on the road. Mick was their tour manager, lighting director, stage manager, seemed like he did everything. RIP Mick, read full post:\nhttps://t.co/K7Z7ZiWNpH https://t.co/2vT5RrVl1b",
            "tweet": "mick brigden was the first person that took care of me on the road. montrose opened for humble pie for the 3 years we were on the road. mick was their tour manager, lighting director, stage manager, seemed like he did everything. rip mick, read full post:\n "
        },
        {
            "date": "2021-06-14 13:40:52+00:00",
            "tweet_raw": "I can drive 155 now. #policeescort @TXMotorSpeedway @txmotorspeedway @NASCAR #iamready #copshavinfun #backintheblue https://t.co/fqrKbMmgVR",
            "tweet": "i can drive 155 now.        "
        },
        {
            "date": "2021-10-07 23:09:35+00:00",
            "tweet_raw": "arriving in a sheriff's car for the VIP show #live #catalina #redheadsrule  #partytime https://t.co/yShLNEDg0u",
            "tweet": "arriving in a sheriff's car for the vip show      "
        },
        {
            "date": "2021-05-25 21:31:04+00:00",
            "tweet_raw": "More photos from the first show back! FL folks grab tickets while you can for upcoming shows at https://t.co/At6ukBJvl6\n\n📸: Jeremy Simmons https://t.co/Op3PDYlvC0",
            "tweet": "more photos from the first show back! fl folks grab tickets while you can for upcoming shows at \n\n📸: jeremy simmons "
        },
        {
            "date": "2021-06-24 00:24:13+00:00",
            "tweet_raw": "Happy 34th anniversary to 'I Never Said Goodbye'! \nCelebrate with the music video for \"Hands and Knees\". The brain machine was some wacky invention: you could actually lose track of time after a few minutes on this thing. Very psychedelic. https://t.co/XIh0YhykZy",
            "tweet": "happy 34th anniversary to 'i never said goodbye'! \ncelebrate with the music video for \"hands and knees\". the brain machine was some wacky invention: you could actually lose track of time after a few minutes on this thing. very psychedelic. "
        },
        {
            "date": "2021-06-07 04:06:50+00:00",
            "tweet_raw": "Get ready to rock, roll, and race 🎸 Tune into @NASCARONFOX next Sunday for the @NASCAR All-Star Race and a special pre-race performance 🏁 \n\nI’m sure you can guess what song I’ll play before the race starts! Don’t miss it on @FS1! 🏎 https://t.co/kUzZSQ188G",
            "tweet": "get ready to rock, roll, and race 🎸 tune into  next sunday for the  all-star race and a special pre-race performance 🏁 \n\ni’m sure you can guess what song i’ll play before the race starts! don’t miss it on ! 🏎 "
        },
        {
            "date": "2021-07-07 16:08:05+00:00",
            "tweet_raw": "As much as I love to play guitar, when you got a guy like Vic Johnson on your team you will always be the second guitarist!!! ❤️🤟🥂 my brother.",
            "tweet": "as much as i love to play guitar, when you got a guy like vic johnson on your team you will always be the second guitarist!!! ❤️🤟🥂 my brother."
        },
        {
            "date": "2021-03-16 19:02:17+00:00",
            "tweet_raw": "Triple the tequila, triple the fun: get $20 off the purchase of all 3 Santo products for a limited time only. \n\nThe Santo Family is on the road again too, celebrating the official launch of Santo Reposado. Follow on @ santospirit Instagram Stories &amp; get a behind the scenes look!",
            "tweet": "triple the tequila, triple the fun: get $20 off the purchase of all 3 santo products for a limited time only. \n\nthe santo family is on the road again too, celebrating the official launch of santo reposado. follow on @ santospirit instagram stories &amp; get a behind the scenes look!"
        },
        {
            "date": "2021-07-07 16:08:05+00:00",
            "tweet_raw": "As much as I love to play guitar, when you got a guy like Vic Johnson on your team you will always be the second guitarist!!! ❤️🤟🥂 my brother.",
            "tweet": "as much as i love to play guitar, when you got a guy like vic johnson on your team you will always be the second guitarist!!! ❤️🤟🥂 my brother."
        },
        {
            "date": "2021-04-09 23:39:05+00:00",
            "tweet_raw": "Hear Mikey talk about what it was like the first time we played together in Van Halen! He’ll be chatting about the Circle, the Van Halen days, and more in his interview tonight on @gormanrocks! https://t.co/TW7PPlPieu",
            "tweet": "hear mikey talk about what it was like the first time we played together in van halen! he’ll be chatting about the circle, the van halen days, and more in his interview tonight on ! "
        },
        {
            "date": "2021-03-24 16:00:06+00:00",
            "tweet_raw": ".@RossHalfin's new book dives deep into his Van Halen archives, including the #VanHagar era which was born when '5150' was released. Check it out here: https://t.co/rA4I1BS4Xt",
            "tweet": ".'s new book dives deep into his van halen archives, including the  era which was born when '5150' was released. check it out here: "
        },
        {
            "date": "2021-10-02 13:47:08+00:00",
            "tweet_raw": "\"The background singer girls were called \"The Blackberries\" and were for hire and not part of the band.  This was me trying to write like Van Morrison... 1978 -- I was 30 years old, can you believe that?!\" - Sammy\nhttps://t.co/zRmOcOkpDZ",
            "tweet": "\"the background singer girls were called \"the blackberries\" and were for hire and not part of the band.  this was me trying to write like van morrison... 1978 -- i was 30 years old, can you believe that?!\" - sammy\n"
        },
        {
            "date": "2021-07-28 17:00:02+00:00",
            "tweet_raw": "Some fan shots from the past couple of shows! 🤘 Check out those F#%K 2020 Circle tees 🙌\n\n📸: JoAnne Wojcik Bierzynski, Mitzi Herbold, Cabo Raybo, Reggie Hayse https://t.co/4rjuZU1t1Z",
            "tweet": "some fan shots from the past couple of shows! 🤘 check out those f#%k 2020 circle tees 🙌\n\n📸: joanne wojcik bierzynski, mitzi herbold, cabo raybo, reggie hayse "
        },
        {
            "date": "2021-07-30 17:27:34+00:00",
            "tweet_raw": "What do you think we said that had Mona like ￼ ￼ I don't think you can have any more fun while working a real job if you wanna call it that. The Wabos were a blast. #Flashback to this day in 2010! 11 years ago, the Wabos were rockin' it at the Cabo Wabo Cantina in Vegas. https://t.co/jxHIE08uFm",
            "tweet": "what do you think we said that had mona like ￼ ￼ i don't think you can have any more fun while working a real job if you wanna call it that. the wabos were a blast.  to this day in 2010! 11 years ago, the wabos were rockin' it at the cabo wabo cantina in vegas. "
        },
        {
            "date": "2021-04-02 16:00:00+00:00",
            "tweet_raw": "Donate today to @keeplivealives1 for a chance to win an Epiphone SG Special guitar signed by Sammy! 🎸 For every donation of $25 or more, you'll have one chance to win ($25=one chance, $50=two chances, $75=three chances, etc). Raffle ends this Sunday! https://t.co/IPHwSQDwOY https://t.co/9EQDPWTj51",
            "tweet": "donate today to  for a chance to win an epiphone sg special guitar signed by sammy! 🎸 for every donation of $25 or more, you'll have one chance to win ($25=one chance, $50=two chances, $75=three chances, etc). raffle ends this sunday!  "
        },
        {
            "date": "2022-01-21 18:09:55+00:00",
            "tweet_raw": "It’s my brother-from-another-mother’s birthday this Saturday and you know @santo_spirit is coming through with the celebrations! They’re giving away a chef knife signed by @GuyFieri himself and all you have to do is head on over to their post to enter 🎉 https://t.co/7qob5PCihP https://t.co/bKh7O2WlMm",
            "tweet": "it’s my brother-from-another-mother’s birthday this saturday and you know  is coming through with the celebrations! they’re giving away a chef knife signed by  himself and all you have to do is head on over to their post to enter 🎉  "
        },
        {
            "date": "2021-05-25 19:00:00+00:00",
            "tweet_raw": "We owe it all to the real heroes of 2020 💪\n\nCheck out @UltClassicRock's recap of the Circle's first show back post-COVID: https://t.co/N1oh4octJN",
            "tweet": "we owe it all to the real heroes of 2020 💪\n\ncheck out 's recap of the circle's first show back post-covid: "
        },
        {
            "date": "2021-08-20 00:34:04+00:00",
            "tweet_raw": "and masks will be required to be worn by all individuals. Should you be unable to attend, we have added a 2 day period for those who wish to surrender their entry in the drawing. The random drawing schedule for tickets has also been revised. (2/3)",
            "tweet": "and masks will be required to be worn by all individuals. should you be unable to attend, we have added a 2 day period for those who wish to surrender their entry in the drawing. the random drawing schedule for tickets has also been revised. (2/3)"
        },
        {
            "date": "2021-05-09 15:00:03+00:00",
            "tweet_raw": "to Kari the mother of our 2 children. we hope your day is as beautiful as you are. we ❤️ you #motherto1mothertoall\nSammy https://t.co/PyLSrBMnKi",
            "tweet": "to kari the mother of our 2 children. we hope your day is as beautiful as you are. we ❤️ you \nsammy "
        },
        {
            "date": "2021-03-16 19:02:02+00:00",
            "tweet_raw": "Sammy and @GuyFieri are here with a special announcement...\n\nIt's official - @santo_spirit Tequila Reposado is here! Head to the Santo Spirit website now to buy yours and have a taste of what we think is the world's finest Reposado: https://t.co/J24YNxVcLV https://t.co/5R3dVXCAKC",
            "tweet": "sammy and  are here with a special announcement...\n\nit's official -  tequila reposado is here! head to the santo spirit website now to buy yours and have a taste of what we think is the world's finest reposado:  "
        },
        {
            "date": "2021-03-12 01:22:04+00:00",
            "tweet_raw": "Sammy's always happy to support his longtime friends @ \n@KSHE95! Catch him as a guest during tomorrow's @keeplivealives1 event. The fundraiser supports St Louis entertainment industry professionals who've been struggling due to loss of work w/ the pandemic https://t.co/3xdIOuBCNG https://t.co/3AVGZrnppZ",
            "tweet": "sammy's always happy to support his longtime friends @ \n! catch him as a guest during tomorrow's  event. the fundraiser supports st louis entertainment industry professionals who've been struggling due to loss of work w/ the pandemic  "
        },
        {
            "date": "2021-07-01 18:04:38+00:00",
            "tweet_raw": "Pre-sale starts tomorrow @ 10 AM PST-Make sure you're subscribed to Sammy's email list to be the first to know the code: https://t.co/BWNsdNbnWL \nAdditional shows for 2022 will be announced shortly! \nPublic on sale is on Saturday, July 3 @ 10 AM PT @ https://t.co/a1nEcc8IlZ (2/2)",
            "tweet": "pre-sale starts tomorrow @ 10 am pst-make sure you're subscribed to sammy's email list to be the first to know the code:  \nadditional shows for 2022 will be announced shortly! \npublic on sale is on saturday, july 3 @ 10 am pt @  (2/2)"
        },
        {
            "date": "2021-03-06 01:00:00+00:00",
            "tweet_raw": "Less than one week until @ARFtweets’ 30th annual Stars to the Rescue virtual show! Sammy &amp; The Circle are excited to participate and support the cause with a special pre-recorded performance. You won't want to miss it! https://t.co/KdYxETRCCs",
            "tweet": "less than one week until ’ 30th annual stars to the rescue virtual show! sammy &amp; the circle are excited to participate and support the cause with a special pre-recorded performance. you won't want to miss it! "
        },
        {
            "date": "2022-01-01 17:52:57+00:00",
            "tweet_raw": "Got news that I’m being honored as ambassador of tourism for Los Cabos, something I’ve been waiting for since 1981! celebrate with me on the 5th — ceremony at noon at the main plaza in San Jose Del Cabo + then we’re gonna throw a concert at the Cabo Wabo, first come first serve! https://t.co/WikC56VhQW",
            "tweet": "got news that i’m being honored as ambassador of tourism for los cabos, something i’ve been waiting for since 1981! celebrate with me on the 5th — ceremony at noon at the main plaza in san jose del cabo + then we’re gonna throw a concert at the cabo wabo, first come first serve! "
        },
        {
            "date": "2021-12-11 23:49:29+00:00",
            "tweet_raw": "grow it long, shave it off! It's been a long time but the beard had to go for the holidays. Started looking too much like #santaclaus now I know what's under there 😰#beardbegone https://t.co/qsXejspa0M",
            "tweet": "grow it long, shave it off! it's been a long time but the beard had to go for the holidays. started looking too much like  now i know what's under there 😰 "
        },
        {
            "date": "2021-11-30 23:19:09+00:00",
            "tweet_raw": "my partner &amp; buddy @GuyFieri looking smart and ready to rock like @BillyIdol do you think Billy can cook #gottequila @santo_spirit https://t.co/gmcBJ2GMze",
            "tweet": "my partner &amp; buddy  looking smart and ready to rock like  do you think billy can cook   "
        },
        {
            "date": "2021-11-15 00:26:30+00:00",
            "tweet_raw": "Get ready to rock and roll with The Circle and an ice-cold can of Sammy's Beach Bar Cocktail Company! Enter to win VIP tickets to A Toast To Texas Tour this December and join in on the party  🤘 \nVisit https://t.co/0E85CprNmb to enter and find out more. https://t.co/ZW9uUZBO2X",
            "tweet": "get ready to rock and roll with the circle and an ice-cold can of sammy's beach bar cocktail company! enter to win vip tickets to a toast to texas tour this december and join in on the party  🤘 \nvisit  to enter and find out more. "
        },
        {
            "date": "2021-09-16 16:21:27+00:00",
            "tweet_raw": "“Hippies and Musicians Use Back Door” ???  — took a short break and we got locked out of RCA Studios in Nashville! You can’t stop this music - we’ll get back in and continue working on the new Circle album! https://t.co/P4kVEPyRUR",
            "tweet": "“hippies and musicians use back door” ???  — took a short break and we got locked out of rca studios in nashville! you can’t stop this music - we’ll get back in and continue working on the new circle album! "
        },
        {
            "date": "2021-06-29 20:02:04+00:00",
            "tweet_raw": "Excited to bring you my own canned sparkling rum cocktails – Tangerine Dream, Pineapple Splash, Island Pop and Cherry Kola Chill. Stay tuned for more details in the months to come, and read all about the new drinks in this piece from @USATODAY; https://t.co/azrVXHY0hG",
            "tweet": "excited to bring you my own canned sparkling rum cocktails – tangerine dream, pineapple splash, island pop and cherry kola chill. stay tuned for more details in the months to come, and read all about the new drinks in this piece from ; "
        }
    ],
    "len": 100
}