{
    "account": "@taylorswift13",
    "type": "Pop",
    "tweets": [
        {
            "date": "2019-12-13 05:08:28+00:00",
            "tweet_raw": "WHO’S GONNA TELL HER SHE’S THIRTAY NOW 🧁 https://t.co/PChgBjOxwB",
            "tweet": "who’s gonna tell her she’s thirtay now 🧁 "
        },
        {
            "date": "2019-11-14 23:35:53+00:00",
            "tweet_raw": "Don’t know what else to do https://t.co/1uBrXwviTS",
            "tweet": "don’t know what else to do "
        },
        {
            "date": "2021-09-05 03:30:35+00:00",
            "tweet_raw": "What a beautiful moment, CONGRATULATIONS ANITA!! 🥲🥲👏👏 https://t.co/oUTjh8lGND",
            "tweet": "what a beautiful moment, congratulations anita!! 🥲🥲👏👏 "
        },
        {
            "date": "2020-06-12 20:07:54+00:00",
            "tweet_raw": "Edward Carmack’s statue was sitting in the state Capitol until it was torn down last week in the protests. The state of Tennessee has vowed to replace it.",
            "tweet": "edward carmack’s statue was sitting in the state capitol until it was torn down last week in the protests. the state of tennessee has vowed to replace it."
        },
        {
            "date": "2020-05-18 19:58:45+00:00",
            "tweet_raw": "The City Of Lover concert is streaming on @Hulu + @DisneyPlus! And the live songs are available now 💕 https://t.co/KZNhsi9o3Y\n\n#TaylorSwiftCityOfLover https://t.co/LTTkqliMWY",
            "tweet": "the city of lover concert is streaming on  + ! and the live songs are available now 💕 \n\n "
        },
        {
            "date": "2020-09-13 17:58:32+00:00",
            "tweet_raw": "Bout to show up at your party @ACMawards 😺 https://t.co/ekNJfv4hci",
            "tweet": "bout to show up at your party  😺 "
        },
        {
            "date": "2019-12-14 17:09:54+00:00",
            "tweet_raw": "Honestly spending my 30th with the fans who have made my life what it is at jingle ball, then throwing the most aggressive holiday party known to womankind... I just.. seriously feel so lucky and will spend forever trying to find ways to say thank you. *cries in Christmas tree* https://t.co/40RSnRGcPm",
            "tweet": "honestly spending my 30th with the fans who have made my life what it is at jingle ball, then throwing the most aggressive holiday party known to womankind... i just.. seriously feel so lucky and will spend forever trying to find ways to say thank you. *cries in christmas tree* "
        },
        {
            "date": "2020-12-06 16:13:22+00:00",
            "tweet_raw": "@_DionneWarwick I just saw that you tweeted me!! I’m a huge fan and I respect you so much, thank you for wishing me well. I hope you have a wonderful holiday season, thank you for spreading joy 💕🥰🙏",
            "tweet": " i just saw that you tweeted me!! i’m a huge fan and i respect you so much, thank you for wishing me well. i hope you have a wonderful holiday season, thank you for spreading joy 💕🥰🙏"
        },
        {
            "date": "2019-11-07 13:04:03+00:00",
            "tweet_raw": "Earring said SMILE but I stay smirking. 😏 https://t.co/g0R19uKl1t",
            "tweet": "earring said smile but i stay smirking. 😏 "
        },
        {
            "date": "2020-02-06 17:05:36+00:00",
            "tweet_raw": "It’s an honor to get to work with such an incredible team, especially when it comes to my favorite thing in the world: songwriting. 🎶😄 &amp; swipe photos to see one of my other fav things: a fluffy floofy cat.",
            "tweet": "it’s an honor to get to work with such an incredible team, especially when it comes to my favorite thing in the world: songwriting. 🎶😄 &amp; swipe photos to see one of my other fav things: a fluffy floofy cat."
        },
        {
            "date": "2019-12-09 14:45:28+00:00",
            "tweet_raw": "I woke up today to the news that Beautiful Ghosts is nominated for a Golden Globe - it’s so cool that one of the most fun, fulfilling creative experiences I’ve ever had is being honored in this way by the HFPA. https://t.co/f8Ypo3b9VW",
            "tweet": "i woke up today to the news that beautiful ghosts is nominated for a golden globe - it’s so cool that one of the most fun, fulfilling creative experiences i’ve ever had is being honored in this way by the hfpa. "
        },
        {
            "date": "2020-05-25 02:11:02+00:00",
            "tweet_raw": "VERY STOKED about this cover of lwymmd on @KillingEve by Jack leopards &amp; the dolphin club!! https://t.co/fhkLfOssfm",
            "tweet": "very stoked about this cover of lwymmd on  by jack leopards &amp; the dolphin club!! "
        },
        {
            "date": "2021-06-03 00:59:47+00:00",
            "tweet_raw": "@kalob_3x89 FANTASTIC PICTURE!! Love seeing you smile like that! Happy Pride Month to you too! 🏳️‍🌈",
            "tweet": " fantastic picture!! love seeing you smile like that! happy pride month to you too! 🏳️‍🌈"
        },
        {
            "date": "2019-11-25 07:52:34+00:00",
            "tweet_raw": "I was up there because of you and I know that every minute of every day ❤️ photo by 📸 Kevin Winter https://t.co/k9RW2qWdMo",
            "tweet": "i was up there because of you and i know that every minute of every day ❤️ photo by 📸 kevin winter "
        },
        {
            "date": "2020-06-12 20:07:58+00:00",
            "tweet_raw": "I’m asking the Capitol Commission and the Tennessee Historical Commission to please consider the implications of how hurtful it would be to continue fighting for these monuments.",
            "tweet": "i’m asking the capitol commission and the tennessee historical commission to please consider the implications of how hurtful it would be to continue fighting for these monuments."
        },
        {
            "date": "2020-04-27 21:08:40+00:00",
            "tweet_raw": "Not a lot going on at the moment https://t.co/NaRCqgCH4Y",
            "tweet": "not a lot going on at the moment "
        },
        {
            "date": "2020-05-18 02:09:08+00:00",
            "tweet_raw": "@CaleighAMiller YAY! Glad you’re watching 💕",
            "tweet": " yay! glad you’re watching 💕"
        },
        {
            "date": "2020-11-25 14:15:41+00:00",
            "tweet_raw": "folklore: the long pond studio sessions (from the Disney+ special) deluxe edition album is out everywhere now! https://t.co/BuIIVbMy71 https://t.co/2XXhTNwpyZ",
            "tweet": "folklore: the long pond studio sessions (from the disney+ special) deluxe edition album is out everywhere now!  "
        },
        {
            "date": "2020-03-20 18:01:43+00:00",
            "tweet_raw": "While we’re looking for things to do at home, I thought it’d be fun to share behind the scenes of my dad’s acting debut. 🎾 https://t.co/1WIBE8jdfb",
            "tweet": "while we’re looking for things to do at home, i thought it’d be fun to share behind the scenes of my dad’s acting debut. 🎾 "
        },
        {
            "date": "2019-11-09 03:35:59+00:00",
            "tweet_raw": "🍬💕pretty city 🍭🌸 https://t.co/mBIBfrbFMm",
            "tweet": "🍬💕pretty city 🍭🌸 "
        },
        {
            "date": "2020-06-19 17:09:36+00:00",
            "tweet_raw": "Can’t wait to watch @Disclosure_Doc on @netflix today!! Executive produced by @Lavernecox who is extraordinary 💕💕💕 Who else is gonna watch?! https://t.co/tYnZXfYzk5",
            "tweet": "can’t wait to watch  on  today!! executive produced by  who is extraordinary 💕💕💕 who else is gonna watch?! "
        },
        {
            "date": "2020-05-17 17:15:45+00:00",
            "tweet_raw": "Stoked to relive our Paris show tonight when the City of Lover concert airs at 10pm ET/9pm CT on @ABCNetwork - then tomorrow on @hulu and @disneyplus 💕 It was the best album release party I could’ve wished for 😆✨💐🎆🕶 love you guys 💋 https://t.co/G9Dm3nYrgv",
            "tweet": "stoked to relive our paris show tonight when the city of lover concert airs at 10pm et/9pm ct on  - then tomorrow on  and  💕 it was the best album release party i could’ve wished for 😆✨💐🎆🕶 love you guys 💋 "
        },
        {
            "date": "2019-11-12 16:07:10+00:00",
            "tweet_raw": "According to my jet lag it is one hundred o clock celsius. https://t.co/F4rNMwFkNl",
            "tweet": "according to my jet lag it is one hundred o clock celsius. "
        },
        {
            "date": "2020-02-18 05:24:04+00:00",
            "tweet_raw": "The Man - Live From Paris is out now! https://t.co/QZofz2CNxF https://t.co/8lFwIRI79U",
            "tweet": "the man - live from paris is out now!  "
        },
        {
            "date": "2020-06-12 20:07:58+00:00",
            "tweet_raw": "I’m asking the Capitol Commission and the Tennessee Historical Commission to please consider the implications of how hurtful it would be to continue fighting for these monuments.",
            "tweet": "i’m asking the capitol commission and the tennessee historical commission to please consider the implications of how hurtful it would be to continue fighting for these monuments."
        },
        {
            "date": "2020-08-03 23:37:19+00:00",
            "tweet_raw": "@jpcleds WOW this is incredible!! Thank you so much for making this. 🎂 I also saw your Instagram and your art is phenomenal!👏👏👏😘😘😘",
            "tweet": " wow this is incredible!! thank you so much for making this. 🎂 i also saw your instagram and your art is phenomenal!👏👏👏😘😘😘"
        },
        {
            "date": "2019-11-04 22:36:00+00:00",
            "tweet_raw": "Playing with filters and yelling with the Legend himself. Tune in to @NBCTheVoice tonight at 8/7c! @johnlegend https://t.co/OG5AZ8XCjr",
            "tweet": "playing with filters and yelling with the legend himself. tune in to  tonight at 8/7c!  "
        },
        {
            "date": "2020-10-07 20:23:44+00:00",
            "tweet_raw": "I spoke to @vmagazine about why I’ll be voting for Joe Biden for president. So apt that it’s come out on the night of the VP debate. Gonna be watching and supporting @KamalaHarris by yelling at the tv a lot. And I also have custom cookies 🍪💪😘 \n\n📷 @inezandvinoodh https://t.co/DByvIgKocr",
            "tweet": "i spoke to  about why i’ll be voting for joe biden for president. so apt that it’s come out on the night of the vp debate. gonna be watching and supporting  by yelling at the tv a lot. and i also have custom cookies 🍪💪😘 \n\n📷  "
        },
        {
            "date": "2021-11-05 12:50:50+00:00",
            "tweet_raw": "November 12. Remember it. \n\n@SadieSink \n@dylanobrien https://t.co/fTAd8dItX0",
            "tweet": "november 12. remember it. \n\n \n "
        },
        {
            "date": "2020-06-12 20:07:54+00:00",
            "tweet_raw": "As a Tennessean, it makes me sick that there are monuments standing in our state that celebrate racist historical figures who did evil things. Edward Carmack and Nathan Bedford Forrest were DESPICABLE figures in our state history and should be treated as such.",
            "tweet": "as a tennessean, it makes me sick that there are monuments standing in our state that celebrate racist historical figures who did evil things. edward carmack and nathan bedford forrest were despicable figures in our state history and should be treated as such."
        },
        {
            "date": "2020-02-27 10:38:56+00:00",
            "tweet_raw": "One small step for the man, one giant leap for #TheManMusicVideo...1.5 hours to go! I’m counting down with you on the premiere page: https://t.co/HnovGRN82i https://t.co/rYrxqzNYwF",
            "tweet": "one small step for the man, one giant leap for ...1.5 hours to go! i’m counting down with you on the premiere page:  "
        },
        {
            "date": "2020-06-09 19:09:56+00:00",
            "tweet_raw": "Racial injustice has been ingrained deeply into local and state governments, and changes MUST be made there. In order for policies to change, we need to elect people who will fight against police brutality and racism of any kind. #BlackLivesMatter",
            "tweet": "racial injustice has been ingrained deeply into local and state governments, and changes must be made there. in order for policies to change, we need to elect people who will fight against police brutality and racism of any kind. "
        },
        {
            "date": "2020-07-24 04:18:01+00:00",
            "tweet_raw": "I knew you tried to change the ending, Peter losing Wendy. The #cardiganMusicVideo is out now.\n\nhttps://t.co/Yu1UmTNnJI https://t.co/gDgNhkDUuq",
            "tweet": "i knew you tried to change the ending, peter losing wendy. the  is out now.\n\n "
        },
        {
            "date": "2020-05-19 20:31:11+00:00",
            "tweet_raw": "@etnow I personally really relate to this tweet. 😎",
            "tweet": " i personally really relate to this tweet. 😎"
        },
        {
            "date": "2019-12-04 17:58:27+00:00",
            "tweet_raw": "Sock Appreciation Post 🧦 https://t.co/xCAxNKKHei",
            "tweet": "sock appreciation post 🧦 "
        },
        {
            "date": "2019-11-07 13:04:03+00:00",
            "tweet_raw": "Earring said SMILE but I stay smirking. 😏 https://t.co/g0R19uKl1t",
            "tweet": "earring said smile but i stay smirking. 😏 "
        },
        {
            "date": "2020-05-08 12:47:13+00:00",
            "tweet_raw": "Excited to announce the City of Lover Concert! We filmed my show in Paris in September and thought it’d be fun to share it with you 😄May 17 at 10p ET on @abcnetwork and available the next day on @hulu and @disneyplus! #TaylorSwiftCityOfLover https://t.co/7B3ky0rO5B",
            "tweet": "excited to announce the city of lover concert! we filmed my show in paris in september and thought it’d be fun to share it with you 😄may 17 at 10p et on  and available the next day on  and !  "
        },
        {
            "date": "2021-09-20 20:14:21+00:00",
            "tweet_raw": "It’s true, I signed them all and it’s also true that I may never write the same again, as my hand is now frozen in the permanent shape of a claw. All for you 😘 https://t.co/mnSkHyNCy6",
            "tweet": "it’s true, i signed them all and it’s also true that i may never write the same again, as my hand is now frozen in the permanent shape of a claw. all for you 😘 "
        },
        {
            "date": "2019-11-06 06:12:16+00:00",
            "tweet_raw": "Have arrived in the land of cat cafes and eternal cuteness TOKYO HI 💕🌸🍭🍬🎆 I’m off to stare into pastel aquariums and hug all the people CAN’T WAIT TO SEE YOU GUYS LATER! https://t.co/M2uvgIHe4i",
            "tweet": "have arrived in the land of cat cafes and eternal cuteness tokyo hi 💕🌸🍭🍬🎆 i’m off to stare into pastel aquariums and hug all the people can’t wait to see you guys later! "
        },
        {
            "date": "2019-11-12 16:07:10+00:00",
            "tweet_raw": "According to my jet lag it is one hundred o clock celsius. https://t.co/F4rNMwFkNl",
            "tweet": "according to my jet lag it is one hundred o clock celsius. "
        },
        {
            "date": "2020-06-12 20:07:54+00:00",
            "tweet_raw": "Edward Carmack’s statue was sitting in the state Capitol until it was torn down last week in the protests. The state of Tennessee has vowed to replace it.",
            "tweet": "edward carmack’s statue was sitting in the state capitol until it was torn down last week in the protests. the state of tennessee has vowed to replace it."
        },
        {
            "date": "2021-11-14 01:43:48+00:00",
            "tweet_raw": "Loving him was Redd. 😘 https://t.co/41iOOoB0qK",
            "tweet": "loving him was redd. 😘 "
        },
        {
            "date": "2020-05-18 02:17:47+00:00",
            "tweet_raw": "@13yearsoftay Aww thanks bud 🥺🥺🥺🏹💗",
            "tweet": " aww thanks bud 🥺🥺🥺🏹💗"
        },
        {
            "date": "2021-04-19 21:04:00+00:00",
            "tweet_raw": "CONGRATS @lanawilson 😇😇😇 !!! And a million hugs to the fans who made this happen! https://t.co/YMRWLZTWaa",
            "tweet": "congrats  😇😇😇 !!! and a million hugs to the fans who made this happen! "
        },
        {
            "date": "2021-11-14 15:03:03+00:00",
            "tweet_raw": "SURPRISE! NEW MUSIC VIDEO TOMORROW at 10am ET 🚨 I finally got to work with the brilliant, brave, &amp; wickedly funny @blakelively on her directorial debut. Join us as we raise a toast, and a little hell. \n\nhttps://t.co/Gm4xT1vuNk https://t.co/2Qh7KEVUpD",
            "tweet": "surprise! new music video tomorrow at 10am et 🚨 i finally got to work with the brilliant, brave, &amp; wickedly funny  on her directorial debut. join us as we raise a toast, and a little hell. \n\n "
        },
        {
            "date": "2020-06-12 20:07:57+00:00",
            "tweet_raw": "Taking down statues isn’t going to fix centuries of systemic oppression, violence and hatred that black people have had to endure but it might bring us one small step closer to making ALL Tennesseans and visitors to our state feel safe - not just the white ones.",
            "tweet": "taking down statues isn’t going to fix centuries of systemic oppression, violence and hatred that black people have had to endure but it might bring us one small step closer to making all tennesseans and visitors to our state feel safe - not just the white ones."
        },
        {
            "date": "2020-11-25 23:28:37+00:00",
            "tweet_raw": "@thinkzakkIknows @taylornation13 I take that as the highest compliment in existence. 😭😭😭🥺🥺🥺 #folkloreOnDisneyPlus",
            "tweet": "  i take that as the highest compliment in existence. 😭😭😭🥺🥺🥺 "
        },
        {
            "date": "2020-01-15 22:23:28+00:00",
            "tweet_raw": "Miss Americana 🎬 January 31 on @NetflixFilm\n\nhttps://t.co/Ot56y6jnCs https://t.co/hrnxN5IxuY",
            "tweet": "miss americana 🎬 january 31 on \n\n "
        },
        {
            "date": "2019-12-01 17:24:39+00:00",
            "tweet_raw": "This is the one face I made that day https://t.co/fHtArFIxXZ",
            "tweet": "this is the one face i made that day "
        },
        {
            "date": "2020-06-09 19:09:57+00:00",
            "tweet_raw": "This article written by @BarackObama is a fascinating read about changing policy at the state and local levels. https://t.co/kwwFjaXCuC",
            "tweet": "this article written by  is a fascinating read about changing policy at the state and local levels. "
        },
        {
            "date": "2021-11-22 22:20:13+00:00",
            "tweet_raw": "*FERAL SCREECH* https://t.co/YYhcecLUfm",
            "tweet": "*feral screech* "
        },
        {
            "date": "2020-07-30 04:14:34+00:00",
            "tweet_raw": "The video for cardigan “cabin in candlelight” version is out now using new behind-the-scenes footage from the album photoshoot. You can watch it here: https://t.co/rsSvCRO6P3 https://t.co/7lAbxpLybG",
            "tweet": "the video for cardigan “cabin in candlelight” version is out now using new behind-the-scenes footage from the album photoshoot. you can watch it here:  "
        },
        {
            "date": "2020-06-19 04:01:21+00:00",
            "tweet_raw": "Happy Juneteenth! I want to thank @TheRoot and @RhapsoDani for allowing me to post this video about the significance of today, June 19th, and why it should be celebrated as a National holiday. https://t.co/7yjwh4Lddg",
            "tweet": "happy juneteenth! i want to thank  and  for allowing me to post this video about the significance of today, june 19th, and why it should be celebrated as a national holiday. "
        },
        {
            "date": "2021-04-16 16:31:45+00:00",
            "tweet_raw": "I wanted to say thank you to you so today I will be addressing a very pressing issue. 🐈🐈‍⬛❓ https://t.co/kBUybYoV2W",
            "tweet": "i wanted to say thank you to you so today i will be addressing a very pressing issue. 🐈🐈‍⬛❓ "
        },
        {
            "date": "2019-09-21 13:49:12+00:00",
            "tweet_raw": "Threw out our cloaks and our daggers because it’s morning now.. 💜 \n\n📷: Erik Madigan Heck https://t.co/woz8zpzjtw",
            "tweet": "threw out our cloaks and our daggers because it’s morning now.. 💜 \n\n📷: erik madigan heck "
        },
        {
            "date": "2020-02-07 17:09:41+00:00",
            "tweet_raw": "#TheManLyricVideo is out now! https://t.co/AuS7exiv4n https://t.co/3aMvdBve17",
            "tweet": " is out now!  "
        },
        {
            "date": "2020-03-16 21:50:13+00:00",
            "tweet_raw": "For Meredith, self quarantining is a way of life. Be like Meredith. #QuarantineCats https://t.co/yEHJ5c5oFi",
            "tweet": "for meredith, self quarantining is a way of life. be like meredith.  "
        },
        {
            "date": "2020-05-07 17:27:50+00:00",
            "tweet_raw": "🍷 🐍 biiig isolation 🐍 🍷 https://t.co/MJbhD8Bau1",
            "tweet": "🍷 🐍 biiig isolation 🐍 🍷 "
        },
        {
            "date": "2020-01-22 15:38:14+00:00",
            "tweet_raw": "Miss Americana - Official Trailer · It’s been a long time coming ✨ Out in select theaters and on @NetflixFilm January 31\nhttps://t.co/Ot56y6jnCs https://t.co/lGp1mDvBJI",
            "tweet": "miss americana - official trailer · it’s been a long time coming ✨ out in select theaters and on  january 31\n "
        },
        {
            "date": "2020-01-31 13:06:31+00:00",
            "tweet_raw": "#MissAmericana is on @NetflixFilm! I’m excited for you to see it. I want to thank Lana Wilson for her curiosity &amp; for wanting to make this film. It’s wild to be sharing so much of my life because it’s scary to be vulnerable! (understatement of the century) https://t.co/Ot56y6jnCs https://t.co/U40wFv82JL",
            "tweet": " is on ! i’m excited for you to see it. i want to thank lana wilson for her curiosity &amp; for wanting to make this film. it’s wild to be sharing so much of my life because it’s scary to be vulnerable! (understatement of the century)  "
        },
        {
            "date": "2020-05-15 15:07:21+00:00",
            "tweet_raw": "City Of Lover Concert 💕 Airing this Sunday at 10p ET on @ABCNetwork and streaming the next day on @hulu  and @disneyplus! \n#TaylorSwiftCityOfLover\n\n📸: Dave Hogan https://t.co/cYAu74UCut",
            "tweet": "city of lover concert 💕 airing this sunday at 10p et on  and streaming the next day on   and ! \n\n\n📸: dave hogan "
        },
        {
            "date": "2020-09-21 04:11:21+00:00",
            "tweet_raw": "Yeah I showed up at your party...then made a thematic album chapter about it 😄 https://t.co/kW25zqtOqe https://t.co/1M6gwWN7bO",
            "tweet": "yeah i showed up at your party...then made a thematic album chapter about it 😄  "
        },
        {
            "date": "2019-12-01 17:24:39+00:00",
            "tweet_raw": "This is the one face I made that day https://t.co/fHtArFIxXZ",
            "tweet": "this is the one face i made that day "
        },
        {
            "date": "2020-05-11 01:58:55+00:00",
            "tweet_raw": "My conversations with my mom have always been and will always be some of my favorite memories - from when I was 10 months old in this video from Oct. 1990 to now talking every day on the phone. Our talks are everything to me. Myyyyyy goodness I love you Mom. Happy Mother’s Day 💐 https://t.co/Okav6gEt2R",
            "tweet": "my conversations with my mom have always been and will always be some of my favorite memories - from when i was 10 months old in this video from oct. 1990 to now talking every day on the phone. our talks are everything to me. myyyyyy goodness i love you mom. happy mother’s day 💐 "
        },
        {
            "date": "2021-11-18 01:05:53+00:00",
            "tweet_raw": "One of the saddest songs I’ve ever written just got sadder 🙃Drove up to Long Pond Studios to record All Too Well (Sad Girl Autumn Version) with the besties @aaron_dessner @heyjonlow \n\nhttps://t.co/UnbELgJGAi https://t.co/Z1XK2zQkwf",
            "tweet": "one of the saddest songs i’ve ever written just got sadder 🙃drove up to long pond studios to record all too well (sad girl autumn version) with the besties   \n\n "
        },
        {
            "date": "2019-12-04 17:58:27+00:00",
            "tweet_raw": "Sock Appreciation Post 🧦 https://t.co/xCAxNKKHei",
            "tweet": "sock appreciation post 🧦 "
        },
        {
            "date": "2019-12-06 18:13:47+00:00",
            "tweet_raw": "It’s rumored that if you say “Alexa, play the new Taylor Swift on @amazonmusic” out loud, it will make Santa like you more. 🤷‍♀️✨🎅📜 https://t.co/SsNfcgZX3R",
            "tweet": "it’s rumored that if you say “alexa, play the new taylor swift on ” out loud, it will make santa like you more. 🤷‍♀️✨🎅📜 "
        },
        {
            "date": "2020-06-15 17:24:59+00:00",
            "tweet_raw": "YES!! Thank you to the Supreme Court Justices who voted in favor and all the advocates who have fought so hard for this! We still have a long way to go to reach equality, but this is a beautiful step forward. 🌈❤️🧡💛💚💙💜🌈 https://t.co/zTd3i5P2TL",
            "tweet": "yes!! thank you to the supreme court justices who voted in favor and all the advocates who have fought so hard for this! we still have a long way to go to reach equality, but this is a beautiful step forward. 🌈❤️🧡💛💚💙💜🌈 "
        },
        {
            "date": "2020-05-07 21:25:42+00:00",
            "tweet_raw": "I’m absolutely devastated and horrified by the senseless, cold blooded, racially motivated killing of Ahmaud Arbery. #JusticeForAhmaud",
            "tweet": "i’m absolutely devastated and horrified by the senseless, cold blooded, racially motivated killing of ahmaud arbery. "
        },
        {
            "date": "2021-11-13 21:53:52+00:00",
            "tweet_raw": "🤯🤯🤯🤯 https://t.co/NeHganujLO",
            "tweet": "🤯🤯🤯🤯 "
        },
        {
            "date": "2020-07-23 12:12:57+00:00",
            "tweet_raw": "The music video for “cardigan” will premiere tonight, which I wrote/directed. A million thank you’s to my brilliant, bad ass video team - Cinematographer Rodrigo Prieto, producer Jil Hardin, executive producer Rebecca Skinner, AD Joe ‘Oz’ Osbourne https://t.co/2hNXnzFbwY",
            "tweet": "the music video for “cardigan” will premiere tonight, which i wrote/directed. a million thank you’s to my brilliant, bad ass video team - cinematographer rodrigo prieto, producer jil hardin, executive producer rebecca skinner, ad joe ‘oz’ osbourne "
        },
        {
            "date": "2019-10-24 23:02:19+00:00",
            "tweet_raw": "@GiphyPop Because it is. 💁‍♀️ https://t.co/mMjEra8o8y",
            "tweet": " because it is. 💁‍♀️ "
        },
        {
            "date": "2020-06-12 20:07:57+00:00",
            "tweet_raw": "His statue is still standing and July 13th is ‘Nathan Bedford Forrest Day.’ Due to social pressure, the state is trying to overrule this, and Tennesseans might no longer have to stomach it. Fingers crossed.",
            "tweet": "his statue is still standing and july 13th is ‘nathan bedford forrest day.’ due to social pressure, the state is trying to overrule this, and tennesseans might no longer have to stomach it. fingers crossed."
        },
        {
            "date": "2020-06-09 19:09:57+00:00",
            "tweet_raw": "We need to fight for mail-in voting for the 2020 election. No one should have to choose between their health and having their voice heard. https://t.co/4ImsKW1fQN",
            "tweet": "we need to fight for mail-in voting for the 2020 election. no one should have to choose between their health and having their voice heard. "
        },
        {
            "date": "2020-07-24 21:53:03+00:00",
            "tweet_raw": "@stephenszczerba yep just trying to do my part over here 😷🕯😺",
            "tweet": " yep just trying to do my part over here 😷🕯😺"
        },
        {
            "date": "2019-12-05 13:18:23+00:00",
            "tweet_raw": "When in doubt, ask the itty bitty pretty kitty committee. When they shun you with silence, ambivalence, and judgmental brush offs... just put the song out anyway. NEW XMAS SONG AND VIDEO (made from home videos 👨‍👩‍👧‍👦) OUT TONIGHT #ChristmasTreeFarm 🌲🎄🌲🎄🌲🎄🌲🎄🌲🎄🌲🎄🌲 https://t.co/GdlnCAKDLF",
            "tweet": "when in doubt, ask the itty bitty pretty kitty committee. when they shun you with silence, ambivalence, and judgmental brush offs... just put the song out anyway. new xmas song and video (made from home videos 👨‍👩‍👧‍👦) out tonight  🌲🎄🌲🎄🌲🎄🌲🎄🌲🎄🌲🎄🌲 "
        },
        {
            "date": "2020-08-24 04:12:05+00:00",
            "tweet_raw": "The next thematic composition that I put together from the album is out now 🌙 Listen to “folklore: the sleepless nights chapter” here: https://t.co/QFbi6rH5JJ https://t.co/X62Gb3KkjQ",
            "tweet": "the next thematic composition that i put together from the album is out now 🌙 listen to “folklore: the sleepless nights chapter” here:  "
        },
        {
            "date": "2020-02-27 23:02:01+00:00",
            "tweet_raw": "Alongside every great (the) man is a team of hardworking creatives who made this thing happen. Bill Corso &amp; his incredible team and I have worked together before, turning me into a zombie.. but convincing a significant amount of people I was a dude is our crowning achievement. https://t.co/Rn7FmIDz55",
            "tweet": "alongside every great (the) man is a team of hardworking creatives who made this thing happen. bill corso &amp; his incredible team and i have worked together before, turning me into a zombie.. but convincing a significant amount of people i was a dude is our crowning achievement. "
        },
        {
            "date": "2020-06-12 20:07:54+00:00",
            "tweet_raw": "As a Tennessean, it makes me sick that there are monuments standing in our state that celebrate racist historical figures who did evil things. Edward Carmack and Nathan Bedford Forrest were DESPICABLE figures in our state history and should be treated as such.",
            "tweet": "as a tennessean, it makes me sick that there are monuments standing in our state that celebrate racist historical figures who did evil things. edward carmack and nathan bedford forrest were despicable figures in our state history and should be treated as such."
        },
        {
            "date": "2019-09-18 18:25:09+00:00",
            "tweet_raw": "It’s blue, the feeling I got 💙\n\n📷: Erik Madigan Heck https://t.co/vlHis2SMIU",
            "tweet": "it’s blue, the feeling i got 💙\n\n📷: erik madigan heck "
        },
        {
            "date": "2020-08-18 13:13:48+00:00",
            "tweet_raw": "folklore deluxe edition featuring bonus song “the lakes” is now available to stream/download 🌊\nhttps://t.co/OTi6HJH2ir\n\n📷: Beth Garrabrant https://t.co/C65Ekj31sU",
            "tweet": "folklore deluxe edition featuring bonus song “the lakes” is now available to stream/download 🌊\n\n\n📷: beth garrabrant "
        },
        {
            "date": "2020-07-23 12:12:58+00:00",
            "tweet_raw": "Editor Chancler Haynes, special effects wizards David Lebensfeld &amp; Grant Miller and set designer Ethan Tobman. The entire shoot was overseen by a medical inspector, everyone wore masks, stayed away from each other, and I even did my own hair, makeup, and styling 😂",
            "tweet": "editor chancler haynes, special effects wizards david lebensfeld &amp; grant miller and set designer ethan tobman. the entire shoot was overseen by a medical inspector, everyone wore masks, stayed away from each other, and i even did my own hair, makeup, and styling 😂"
        },
        {
            "date": "2021-04-02 16:01:35+00:00",
            "tweet_raw": "The vault door is about to be as unhinged as you’ll think I am after you watch this video.\n\nLevel: Expert\n\nHappy decoding! https://t.co/xBXBXGVcdb",
            "tweet": "the vault door is about to be as unhinged as you’ll think i am after you watch this video.\n\nlevel: expert\n\nhappy decoding! "
        },
        {
            "date": "2020-06-19 04:01:22+00:00",
            "tweet_raw": "For my family, everything that has transpired recently gives us an opportunity to reflect, listen, and reprogram any part of our lives that hasn’t been loudly and ferociously anti-racist, and to never let privilege lie dormant when it could be used to stand up for what’s right.",
            "tweet": "for my family, everything that has transpired recently gives us an opportunity to reflect, listen, and reprogram any part of our lives that hasn’t been loudly and ferociously anti-racist, and to never let privilege lie dormant when it could be used to stand up for what’s right."
        },
        {
            "date": "2020-06-09 19:09:57+00:00",
            "tweet_raw": "This article written by @BarackObama is a fascinating read about changing policy at the state and local levels. https://t.co/kwwFjaXCuC",
            "tweet": "this article written by  is a fascinating read about changing policy at the state and local levels. "
        },
        {
            "date": "2020-05-17 17:15:45+00:00",
            "tweet_raw": "Stoked to relive our Paris show tonight when the City of Lover concert airs at 10pm ET/9pm CT on @ABCNetwork - then tomorrow on @hulu and @disneyplus 💕 It was the best album release party I could’ve wished for 😆✨💐🎆🕶 love you guys 💋 https://t.co/G9Dm3nYrgv",
            "tweet": "stoked to relive our paris show tonight when the city of lover concert airs at 10pm et/9pm ct on  - then tomorrow on  and  💕 it was the best album release party i could’ve wished for 😆✨💐🎆🕶 love you guys 💋 "
        },
        {
            "date": "2020-05-03 21:41:43+00:00",
            "tweet_raw": "@rhodesmusic Oh I love this so much ☺️☺️☺️",
            "tweet": " oh i love this so much ☺️☺️☺️"
        },
        {
            "date": "2019-12-06 20:01:53+00:00",
            "tweet_raw": "Here we are on said Xmas tree farm. And I just want to say that my parents are the real 90’s fashion icons. I have spoken. https://t.co/jtXGXb7raq",
            "tweet": "here we are on said xmas tree farm. and i just want to say that my parents are the real 90’s fashion icons. i have spoken. "
        },
        {
            "date": "2020-05-18 02:09:08+00:00",
            "tweet_raw": "@CaleighAMiller YAY! Glad you’re watching 💕",
            "tweet": " yay! glad you’re watching 💕"
        },
        {
            "date": "2020-01-30 02:53:46+00:00",
            "tweet_raw": "For a limited time #MissAmericana will be playing in select theaters - tickets available at https://t.co/I4b7yZZZss 🎉 And stream it globally on @NetflixFilm January 31! https://t.co/AzWG6WYkST",
            "tweet": "for a limited time  will be playing in select theaters - tickets available at  🎉 and stream it globally on  january 31! "
        },
        {
            "date": "2020-02-28 00:11:18+00:00",
            "tweet_raw": "Rodrigo Prieto, our DP/cinematographer, is absolutely brilliant and down to earth and hilarious. Ethan Tobman created all those sets. Like, that wasn’t a real yacht. That’s how good he is. 🤯👏",
            "tweet": "rodrigo prieto, our dp/cinematographer, is absolutely brilliant and down to earth and hilarious. ethan tobman created all those sets. like, that wasn’t a real yacht. that’s how good he is. 🤯👏"
        },
        {
            "date": "2020-09-12 20:32:01+00:00",
            "tweet_raw": "@VancityReynolds @jessetyler @blakelively not trying to be The Loudest Woman This Town Has Ever Seen™️ but... I LOVE THIS",
            "tweet": "   not trying to be the loudest woman this town has ever seen™️ but... i love this"
        },
        {
            "date": "2019-10-25 00:26:11+00:00",
            "tweet_raw": "I was so excited when @OfficialALW asked me to write an original song with him for @catsmovie. “Beautiful Ghosts” is performed in the film by the extraordinary Francesca Hayward who plays “Victoria” &amp; reprised by Dame Judi Dench (!!!!!) who plays “Old Deuteronomy” 😺 Coming soon! https://t.co/97Hjk2nlfR",
            "tweet": "i was so excited when  asked me to write an original song with him for . “beautiful ghosts” is performed in the film by the extraordinary francesca hayward who plays “victoria” &amp; reprised by dame judi dench (!!!!!) who plays “old deuteronomy” 😺 coming soon! "
        },
        {
            "date": "2021-08-06 14:02:39+00:00",
            "tweet_raw": "We’ll also be making a bunch of new ones too, since Red (Taylor’s Version) includes so many songs you haven’t heard yet. Till then, I’ll be counting down and picturing it all in my head. In burning red.",
            "tweet": "we’ll also be making a bunch of new ones too, since red (taylor’s version) includes so many songs you haven’t heard yet. till then, i’ll be counting down and picturing it all in my head. in burning red."
        },
        {
            "date": "2020-12-10 13:13:57+00:00",
            "tweet_raw": "I’m forever grateful to the following creatives who have helped and guided me to be able to direct my own videos: Cinematographer Rodrigo Prieto, producer Jil Hardin, 1st AD Joe ‘Oz’ Osbourne, Co-1st AD Ev Salomon, Exec Producer Rebecca Skinner…",
            "tweet": "i’m forever grateful to the following creatives who have helped and guided me to be able to direct my own videos: cinematographer rodrigo prieto, producer jil hardin, 1st ad joe ‘oz’ osbourne, co-1st ad ev salomon, exec producer rebecca skinner…"
        },
        {
            "date": "2020-02-06 22:16:59+00:00",
            "tweet_raw": "#TheManLyricVideo out tomorrow at Noon EST https://t.co/a7D6ZTONGn",
            "tweet": " out tomorrow at noon est "
        },
        {
            "date": "2019-12-06 18:18:29+00:00",
            "tweet_raw": "All I want 4 Christmas is to be that voice you hear faintly in the distance in the mall engulfed in jingly jingle bells 🙏 https://t.co/2r3wBZayGU",
            "tweet": "all i want 4 christmas is to be that voice you hear faintly in the distance in the mall engulfed in jingly jingle bells 🙏 "
        },
        {
            "date": "2020-06-12 20:07:56+00:00",
            "tweet_raw": "Replacing his statue is a waste of state funds and a waste of an opportunity to do the right thing.",
            "tweet": "replacing his statue is a waste of state funds and a waste of an opportunity to do the right thing."
        },
        {
            "date": "2020-06-12 20:07:58+00:00",
            "tweet_raw": "I’m asking the Capitol Commission and the Tennessee Historical Commission to please consider the implications of how hurtful it would be to continue fighting for these monuments.",
            "tweet": "i’m asking the capitol commission and the tennessee historical commission to please consider the implications of how hurtful it would be to continue fighting for these monuments."
        },
        {
            "date": "2019-12-11 21:58:25+00:00",
            "tweet_raw": "If it don’t fits I still sits - small wooden box edition 💋\n📷: Sami Drasin https://t.co/3w9TTzqmSS",
            "tweet": "if it don’t fits i still sits - small wooden box edition 💋\n📷: sami drasin "
        }
    ],
    "len": 100
}